Repository: huzheng001/stardict-3.0.6.2
Catalog: dict/help/*/*.po
Languages: ru

source: StarDict Manual V3.0.2
ru: StarDict Руководство 3.0.2

source: GNOME Documentation Project
ru: Проект документации GNOME

source: Stanford University
ru: Стэнфордский университет

source: Cleaning up English
ru: Исправление английского текста

source: StarDict Manual V2.4.2
ru: Руководство пользователя StarDict, версия 2.4.2

source: Nov 2003
ru: Ноябрь 2003

source: Nov 2010
ru: Ноябрь 2010

source: This manual describes version 3.0.2 of StarDict.
ru: В данном руководстве описывается версия 3.0.2 программы StarDict.

source: Feedback
ru: Обратная связь

source: To report a bug or make a suggestion regarding the <application>StarDict</application> application or this manual, follow the directions in the <ulink url="ghelp:gnome-feedback" type="help">GNOME Feedback Page</ulink>.
ru: Чтобы сообщить об ошибке или передать предложение, связанное с приложением <application>StarDict</application> или данным руководством, следуйте указаниям на <ulink url="ghelp:gnome-feedback" type="help">странице обратной связи GNOME</ulink>.

source: User manual for the StarDict dictionary.
ru: Руководство пользователя словаря StarDict

source: Dictionary
ru: Словарь

source: Introduction
ru: Введение

source: <application>StarDict</application> is a Cross-Platform and international dictionary written in Gtk2. It has powerful features such as "Glob-style pattern matching," "Scan selected word," "Fuzzy query," etc.
ru: <application>StarDict</application> — кроссплатформенный международный словарь, написанный на GTK2. Он предоставляет широкие возможности, такие как «Поиск совпадений по glob-шаблону», «Сканирование выделенного слова», «Нечёткий запрос» и т.д.

source: Getting Started
ru: Начало работы

source: Starting <application>StarDict</application>
ru: Запуск <application>StarDict</application>

source: You can start <application>StarDict</application> in the following ways:
ru: <application>StarDict</application> можно запустить следующим образом:

source: <guimenu>Applications</guimenu> menu
ru: Меню <guimenu>Приложения</guimenu>

source: Choose <menuchoice><guisubmenu>Accessories</guisubmenu><guimenuitem>StarDict</guimenuitem></menuchoice>.
ru: Выберите пункт меню <menuchoice><guisubmenu>Инструменты</guisubmenu><guimenuitem>StarDict</guimenuitem></menuchoice>.

source: Command line
ru: Командная строка

source: Type <command>stardict</command>, then press <keycap>Return</keycap>.
ru: Введите команду <command>stardict</command>, затем нажмите клавишу <keycap>Return</keycap>.

source: You can specify a word to query too:
ru: Можно указать также слово для поиска:

source: word
ru: слово

source: or a Glob-style pattern matching string:
ru: или шаблон для поиска:

source: wo?d*
ru: сло?о*

source: or do a fuzzy query:
ru: или выполнить нечёткий запрос:

source: /word
ru: /слово

source: If <application>StarDict</application> is already running. In Windows edition <application>StarDict</application> activates the first instance of <application>StarDict</application>, then terminates. In Gnome edition <application>StarDict</application> actives the first instance of <application>StarDict</application>, queries the word in that instance if one was supplied on the command line, then terminates.
ru: Если приложение <application>StarDict</application> уже запущено. В версии для Windows <application>StarDict</application> активирует первый экземпляр <application>StarDict</application>, затем завершает работу. В версии для Gnome <application>StarDict</application> активирует первый экземпляр <application>StarDict</application>, выполняет поиск слова в этом экземпляре (если оно было указано в командной строке), затем завершает работу.

source: See <xref linkend="stardict-details-command-line"/> for complete description of command line options.
ru: Полное описание параметров командной строки: <xref linkend="stardict-details-command-line"/>.

source: <application>StarDict</application> Main window
ru: Главное окно <application>StarDict</application>

source: When you start <application>StarDict</application>, the following window appears.
ru: Когда вы запускаете <application>StarDict</application>, появляется следующее окно.

source: <application>StarDict</application> Main Window
ru: Главное окно <application>StarDict</application>

source: Shows <application>StarDict</application> main window. Contains Search field, Tool buttons, Word list, Definition area and Setting buttons.
ru: Показывает главное окно <application>StarDict</application>. Содержит поле поиска, кнопки инструментов, список слов, область определений и кнопки настройки.

source: The <application>StarDict</application><firstterm>Main window</firstterm> consists of the following elements:
ru: <firstterm>Главное окно</firstterm> <guilabel>StarDict</guilabel> состоит из следующих элементов:

source: Top bar
ru: Верхняя панель

source: The top bar consists of the <firstterm>Search field</firstterm> and a number of buttons. Here they are in the order from left to right.
ru: Верхняя панель содержит <firstterm>Поле поиска</firstterm> и несколько кнопок. Далее они перечислены в порядке слева направо.

source: Clear
ru: Очистить

source: Clears the Search field.
ru: Очищает поле поиска.

source: Search field
ru: Поле поиска

source: Use the Search field to enter the word that you want to look up. You can also access recently-queried words through the dropdown box.
ru: Используйте поле поиска для ввода слов, которые требуется найти. В раскрывающемся списке показаны последние запрошенные слова.

source: Fuzzy Query
ru: Нечёткий запрос

source: Fuzzy queries the word entered into the Search field.
ru: Выполняет нечёткий запрос слова, введённого в поле поиска.

source: Go Back
ru: Назад

source: Go back to the word you queried before. Right-click to see a list of words you queried earlier.
ru: Вернуться к слову, запрошенному ранее. Щёлкните правой кнопкой мыши для просмотра списка запрошенных ранее слов.

source: Main menu
ru: Главное меню

source: A button on the right end of the Top bar. It pops up the <application>StarDict</application> Main menu.
ru: Кнопка в правом углу верхней панели. Она открывает главное меню <application>StarDict</application>.

source: Left bar
ru: Левая панель

source: The Left bar contains a number of buttons, here they are in the order from top to bottom:
ru: Левая панель содержит несколько кнопок, далее они перечислены в порядке сверху вниз:

source: Word list
ru: Список слов

source: Opens a list words that have been found in search.
ru: Открывает список слов, которые были найдены при поиске.

source: Results list
ru: Список результатов

source: Opens a list of sources, mainly dictionaries, where the current word has been found. The Definition area combines results from all the sources. Clicking a source in the list scrolls the Definition area window to the definition from that source.
ru: Открывает список источников (главным образом — словарей), где найдено текущее слово. В области определений находятся результаты из всех источников. Если щёлкнуть по какому-либо источнику в списке, в окне области выполняется прокрутка к определению из этого источника.

source: Full-Text Translation
ru: Полнотекстовый перевод

source: Switches to the Full-text translation mode that allows to translate blocks of text, see <xref linkend="stardict-translation"/>.
ru: Переключает в режим полнотекстового перевода, который позволяет переводить блоки текста. См. <xref linkend="stardict-translation"/>.

source: Dictionary groups
ru: Группы словарей

source: Shows a pop-up menu that allows to select a group of dictionaries where to search words. The menu also contains a checkbox to enable network dictionaries.
ru: Вызывает всплывающее меню, которое позволяет выбрать группу словарей для поиска слов. Это меню также содержит флажок для включения сетевых словарей.

source: <guilabel>Previous word</guilabel> and <guilabel>Next word</guilabel>
ru: <guilabel>Предыдущее слово</guilabel> и <guilabel>Следующее слово</guilabel>

source: These buttons are at the bottom part of the Left bar. They work with the Word list and allow to switch to previous and next words in the Word list.
ru: Эти кнопки расположены в нижней части левой панели. Они используются для работы со списком слов и позволяют переключаться между предыдущим и следующим словами в нём.

source: Bottom bar
ru: Нижняя панель

source: The left part of the bar in the order from left to right:
ru: Левая часть панели в порядке слева направо:

source: <guilabel>Scan selection</guilabel> checkbox
ru: Флажок <guilabel>Сканирование выделенного</guilabel>

source: Enable and disables the Scan mode. Checking the <guibutton>Scan selection</guibutton> check button will cause <application>StarDict</application> to automatically look up words that you highlight in any application. See <xref linkend="stardict-scan-selection"/> for more details about the Scan mode.
ru: Включает или отключает режим поиска выделенного. Если флажок <guibutton>Сканирование выделенного</guibutton> установлен, <application>StarDict</application> будет автоматически пытаться найти слова, выделенные пользователем в любом приложении. Дополнительные сведения о режиме поиска выделенного: <xref linkend="stardict-scan-selection"/>.

source: Info
ru: Информация

source: Shows an introduction to using <application>StarDict</application> in the Definition area.
ru: Показывает вводную информацию об использовании <application>StarDict</application> в области определений.

source: Quit
ru: Выйти

source: Quits <application>StarDict</application>.
ru: Закрывает <application>StarDict</application>.

source: The right part of the bar in the order from left to right:
ru: Правая часть панели в порядке слева направо:

source: Internet search
ru: Поиск в Интернете

source: Click the button to initiate Internet search. By default, the first website is used, but you may select any configured website right-clicking the button. <application>StarDict</application> queries the word in the Search field sending a GET request to the configured web page. Result are shown in a web browser. To configure the list of websites see <xref linkend="stardict-prefs-main-window-searchwebsite"/>.
ru: Нажмите кнопку для выполнения поиска в Интернете. По умолчанию используется первый веб-сайт, но по щелчку правой кнопкой мыши можно выбрать любой настроенный веб-сайт. <application>StarDict</application> выполняет поиск слова, указанного в поле поиска, путём отправки запроса GET к настроенной веб-странице. Результаты отображаются в веб-браузере. Сведения о настройке списка веб-сайтов: <xref linkend="stardict-prefs-main-window-searchwebsite"/>.

source: StarDict project website
ru: Веб-сайт проекта StarDict

source: Opens <application>StarDict</application> project website in a web browser.
ru: Открывает веб-сайт проекта <application>StarDict</application> в веб-браузере.

source: Manage dictionaries
ru: Управление словарями

source: Opens <firstterm>Manage dictionaries</firstterm> dialog that allows to configure dictionaries to use, organize them in groups and more.
ru: Открывает диалоговое окно <firstterm>Управление словарями</firstterm>, которое позволяет настроить словари для использования, организовать их в группы, а также сделать многое другое.

source: Preferences
ru: Настройка

source: Opens the <firstterm>Preferences</firstterm> dialog that allows to configuration a multitude of parameters pertaining to <application>StarDict</application>. See <xref linkend="stardict-prefs"/>.
ru: Открывает диалоговое окно <firstterm>Настройка</firstterm>, которое позволяет настроить множество параметров <application>StarDict</application>. См. <xref linkend="stardict-prefs"/>.

source: The smallest half of the <application>StarDict</application> Main window on the left. It contains a list of words that have been found in search. Click a word to show the related articles in the Definition area. You may use a spliter in the middle of the <application>StarDict</application> Main window to divide the space between the Word list and the Definition area.
ru: Меньшая половина главного окна <application>StarDict</application>, расположенная слева. Она содержит список слов, которые были найдены при поиске. Щёлкните по слову для просмотра связанных с ним статей в области определений. Для разделения пространства между списком слов и областью определений можно воспользоваться специальным разделителем в середине главного окна <application>StarDict</application>.

source: Definition area
ru: Область определений

source: The largest half of the <application>StarDict</application> Main window on the right. <application>StarDict</application> displays definition of a word in this area of the window. You may use a spliter in the middle of the StarDict main window to divide the space between the Word list and the Definition area. The Definition area has its own bars: a top toolbar (see <xref linkend="stardict-definition-aria-toolbar"/>) and a bottom search bar (only visible when you search in the Definition area).
ru: Большая половина главного окна <application>StarDict</application>, расположенная справа. В этой области окна <application>StarDict</application> показывает определение слова. Для разделения пространства между списком слов и областью определений можно воспользоваться специальным разделителем в середине главного окна StarDict. Область определений содержит свои собственные панели: панель инструментов сверху (см. <xref linkend="stardict-definition-aria-toolbar"/>) и панель поиска снизу (видна только при поиске в области определений).

source: The following hotkeys are available in the Main window.
ru: В главном окне доступны следующие комбинации клавиш.

source: Hotkeys
ru: Комбинации клавиш

source: <mousebutton>middle</mousebutton> mouse button
ru: <mousebutton>средняя</mousebutton> кнопка мыши

source: This hotkey applies to the Definition area only.
ru: Эта комбинация клавиш работает только в области определений.

source: Query the text selected in the Definition area into the Main window. In Windows edition of <application>StarDict</application>, if there is no selected text, query clipboard content into the Main window.
ru: Искать выбранный в области определений текст в главном окне. В версии <application>StarDict</application> для Windows в том случае, если текст не выбран, в главном окне будет выполнен поиск содержимого буфера обмена.

source: <mousebutton>right</mousebutton> mouse button
ru: <mousebutton>правая</mousebutton> кнопка мыши

source: Show pop-up menu.
ru: Показать всплывающее меню.

source: Definition area toolbar
ru: Панель инструментов области определений

source: The Definition area toolbar is at the top of the <guilabel>Definition area</guilabel>. It contains a number of buttons. Here they are in the left-to-right order.
ru: Панель инструментов области определений находится в её верхней части. Она содержит несколько кнопок. Далее они перечислены в порядке слева направо.

source: Hide(Show) the Word list
ru: Скрыть или показать список слов

source: Hide or show the Word list or the Results list, depending on what is active now.
ru: Скрыть или показать список слов или список результатов (в зависимости от того, какой из них активен)

source: Copy
ru: Копировать

source: Copy the Definition area text into clipboard, all the text.
ru: Копировать весь текст в области определений в буфер обмена.

source: Pronounce the word
ru: Произнести слово

source: This is a button with an additional dropdown menu. Clicking the button you make <application>StarDict</application> pronounce the current word using the first TTS engine that can do that. The dropdown menu allows you to select the TTS engine to use.
ru: Это кнопка с дополнительным раскрывающимся меню. При её нажатии <application>StarDict</application> произнесёт текущее слово с помощью первой программы синтеза речи, которая позволяет это сделать. В раскрывающемся меню можно выбрать программу, которую следует использовать.

source: TTS engines
ru: Программы синтеза речи

source: Real People TTS
ru: Синтез речи «Реальные люди»

source: This engine use sound samples performed by real people.
ru: Эта программа использует звуковые образцы, записанные реальными людьми.

source: Espeak TTS
ru: Программа синтеза речи Espeak

source: Espeak TTS plugin.
ru: Модуль синтеза речи Espeak.

source: Festival TTS
ru: Программа синтеза речи Festival

source: Festival TTS plugin.
ru: Модуль синтеза речи Festival.

source: Command TTS
ru: Команда запуска синтеза речи

source: TTS command you may specify in the Preferences dialog. See <xref linkend="stardict-prefs-dictionary-sound"/>.
ru: Команда запуска синтеза речи, которую можно указать в меню «Настройка». См. <xref linkend="stardict-prefs-dictionary-sound"/>.

source: Depending on configuration settings, installed plugins and other factors, the list of TTS engines may be shorter.
ru: В зависимости от параметров настройки, установленных модулей и прочих факторов, перечень программ синтеза речи может быть более коротким.

source: Save to file
ru: Сохранить в файл

source: Save Definition area text into a file. The new text is appended to the end of the file. The file to use is specified in the <xref linkend="stardict-prefs-dictionary-export"/> section of the <guilabel>Preferences</guilabel> dialog. You may also specify to export only the found word, not its definition. <application>StarDict</application> exports not the word you searched for but the word that was found, the one which translation is shown in the Definition area. When "export only word" is not specified, selection is taken into account. When text is selected in the Definition area, the selected text is exported prepended with the found word. When there are no selected text, all text of the Definition area is exported.
ru: Сохранить текст, расположенный в области определений, в файл. Новый текст добавляется в конец файла. Файл для использования указывается в разделе <xref linkend="stardict-prefs-dictionary-export"/> диалога <guilabel>Настройка</guilabel>. Также можно задать экспорт только найденного слова, а не его определения. <application>StarDict</application> выполняет экспорт не того слова, которое было указано в поисковом запросе, а того слова, которое было найдено (т.е. слова, перевод которого показан в области определений). Если флажок «Экспортировать только слова» не установлен, учитывается выделение. Когда в области определений выделяется текст, он экспортируется (при этом найденное слово предваряет этот текст). Если же текст не был выделен, экспортируется весь текст в области определений.

source: Hotkey: <keycombo><keycap>Alt</keycap><keycap>e</keycap></keycombo>
ru: Комбинация клавиш: <keycombo><keycap>Alt</keycap><keycap>e</keycap></keycombo>

source: Search in the Definition text
ru: Искать в области определений слова

source: Search for text in the Definition area. This button opens the Definitiona area Search bar at the bottom of the Definition area where you may type a word to search.
ru: Искать текст в области определений. Эта кнопка открывает в нижней части области определений панель поиска, где можно указать слово для поиска.

source: Hotkey: <keycombo><keycap>Ctrl</keycap><keycap>f</keycap></keycombo>
ru: Комбинация клавиш: <keycombo><keycap>Ctrl</keycap><keycap>f</keycap></keycombo>

source: Notification area icon
ru: Значок в области уведомлений

source: <application>StarDict</application> will also add an icon to the Notification area. When you iconify the Main window, the window will be hiden. After you click the icon, the window will be shown again. If you right click this icon, it will popup a menu where you can choose to toggle <guimenuitem>Scan selection</guimenuitem>, or to <guimenuitem>Quit</guimenuitem>. You can toggle <guimenuitem>Scan selection</guimenuitem> directly by ctrl-clicking the icon. Clicking the middle mouse button on the icon will query the selected word.
ru: <application>StarDict</application> также добавляет значок в область уведомлений. При сворачивании главное окно скрывается. После щелчка по этому значку окно будет показано снова. Если щёлкнуть по значку правой кнопкой мыши, появится всплывающее меню, которое позволяет включить или отключить опцию<guimenuitem>Сканирование выделенного</guimenuitem> или воспользоваться опцией <guimenuitem>Выйти</guimenuitem>. Включить или отключить опцию <guimenuitem>Сканирование выделенного</guimenuitem> также можно напрямую, путём щелчка по значку при нажатой клавише Ctrl. Если щёлкнуть по значку с нажатием средней кнопки мыши, будет выполнен поиск выделенного слова.

source: <application>StarDict</application>'s notification area icon
ru: Значок <application>StarDict</application> в области уведомлений

source: <application>StarDict</application>'s notification area icon.
ru: Значок <application>StarDict</application> в области уведомлений.

source: Scan selection
ru: Сканирование выделенного

source: <application>StarDict</application> can automatically scan selections. This means that when you select a word or phrase in <application>StarDict</application> or in any other application, <application>StarDict</application> will get the text that you selected and search for it, then display the Floating window containing the result of the search.
ru: <application>StarDict</application> может автоматически выполнять сканирование выделенного: когда слово или фраза выделяются в <application>StarDict</application> или в любом другом приложении, <application>StarDict</application> получает выделенный текст и выполняет его поиск, а затем показывает всплывающее окно с результатом.
