Repository: huzheng001/stardict-3.0.6.2
Catalog: dict/help/*/*.po
Languages: ru

source: Selection is made when you release mouse button. This is the time when the Scan key must be pressed down. It takes some time for StarDict to inspect selection, you must hold the Scan key all this time. What is why you need to hold the key for a few seconds after selection.
ru: Выделение выполняется при отпускании кнопки мыши. В это время необходимо нажать клавишу сканирования. StarDict требуется некоторое время на анализ выделенного фрагмента, поэтому всё это время (несколько секунд) необходимо удерживать клавишу сканирования нажатой.

source: Scanning in Windows
ru: Сканирование в Windows

source: Place the mouse pointer over the word you want to traslate.
ru: Наведите указатель мыши на слово, которое требуется перевести.

source: Do not move the mouse for a few seconds. The Floating Window pops up.
ru: Не перемещайте мышь в течение нескольких секунд. Появится всплывающее окно.

source: For scanning in PDF documents see <xref linkend="stardict-acrobat-plugin"/>.
ru: Информация о сканировании в PDF-документах: <xref linkend="stardict-acrobat-plugin"/>.

source: Toggle Scan Mode
ru: Включение или отключение режима сканирования

source: There are a number of ways to enable or disable the Scan selection mode. When in Scan mode, <application>StarDict</application> shows translation of the text you select in different windows. See <xref linkend="stardict-scan-selection"/>.
ru: Существует ряд способов включения или отключения режима сканирования выделенного. В режиме сканирования <application>StarDict</application> показывает перевод текста, выделяемого пользователем в различных окнах. См. <xref linkend="stardict-scan-selection"/>.

source: Ways to enable the Scan mode
ru: Способы включения режима сканирования

source: Toggle the <guilabel>Scan selection</guilabel> checkbox at the bottom left corner of the <application>StarDict</application> Main window.
ru: Установите флажок <guilabel>Сканирование выделенного</guilabel> в нижнем левом углу главного окна <application>StarDict</application>.

source: Right-click the Notification area icon and check <guimenuitem>Scan</guimenuitem> in the pop-up menu.
ru: Щёлкните правой кнопкой мыши по значку в области уведомлений и выберите в появившемся контекстном меню пункт <guimenuitem>Сканировать</guimenuitem>.

source: Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>x</keycap></keycombo> shortcut (it toggles the Scan mode). To configure the shortcut see <xref linkend="stardict-prefs-dictionary-scan"/>.
ru: Нажмите комбинацию клавиш <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>x</keycap></keycombo> (она включает или отключает режим сканирования). Для настройки комбинации клавиш см. <xref linkend="stardict-prefs-dictionary-scan"/>.

source: Main window hotkeys
ru: Комбинации клавиш главного окна

source: Quit <application>StarDict</application>.
ru: Выйти из <application>StarDict</application>.

source: Minimize to tray. <application>StarDict</application> Main window is closed, taskbar item disappears, but the application continues to run. You may open the Main window again clicking on the Notification area icon.
ru: Свернуть в лоток. Главное окно <application>StarDict</application> закрывается, элемент на панели задач исчезает, но приложение продолжает работать. Главное окно можно открыть снова, щёлкнув по значку в области уведомлений.

source: Iconify the application. The Main window is hidden, the taskbar item remains.
ru: Свернуть приложение. Главное окно скрывается, элемент на панели задач остаётся.

source: Save word definition to a file. See <xref linkend="stardict-definition-aria-toolbar"/> for more details.
ru: Сохранить определение слова в файл. Дополнительная информация: <xref linkend="stardict-definition-aria-toolbar"/>.

source: Show help.
ru: Показать справку.

source: Search in the Definition area. See <xref linkend="stardict-definition-aria-toolbar"/> for more details.
ru: Поиск в области определений. Дополнительная информация: <xref linkend="stardict-definition-aria-toolbar"/>.

source: Left
ru: Стрелка «влево»

source: Go Back. Return to the word that was queried before.
ru: Назад. Возврат к слову, поиск которого был выполнен ранее.

source: Up
ru: Стрелка «вверх»

source: Previous word. Query the previous word in the Word index.
ru: Предыдущее слово. Поиск предыдущего слова в индексе слов.

source: Down
ru: Стрелка «вниз»

source: Next word. Query the next word in the Word index.
ru: Следующее слово. Поиск следующего слова в индексе слов.

source: Menu. Show the Main menu.
ru: Меню. Показать главное меню.

source: Query clipboard text in <application>StarDict</application>.
ru: Поиск текста из буфера обмена в <application>StarDict</application>.

source: Clear the Search field and focus it.
ru: Очистить поле поиска и перейти в него.

source: The same as <keycombo><keycap>Ctrl</keycap><keycap>u</keycap></keycombo>.
ru: Аналогично <keycombo><keycap>Ctrl</keycap><keycap>u</keycap></keycombo>.

source: Enter
ru: Ввод

source: The focus is in the Word list.
ru: Переход в список слов.

source: If the selected index item has children, expand or collapse the item. If the selected index item has no children, query the item in the main window.
ru: Если у выбранного элемента индекса есть дочерние элементы, он будет развёрнут или свёрнут. Если у выбранного элемента индекса нет дочерних элементов, поиск этого элемента будет выполнен в главном окне.

source: The focus is in the Definition area.
ru: Переход в область определений.

source: Requery the text in the Search field.
ru: Повторный поиск текста в поле поиска.

source: Space
ru: Пробел

source: Focus the Search field.
ru: Переход в поле поиска.

source: The focus is in Definition area Search bar.
ru: Переход на панель поиска в области определений.

source: Hide the search bar.
ru: Скрыть панель поиска.

source: Otherwise, this hotkey has the same effect as <keycombo><keycap>Ctrl</keycap><keycap>u</keycap></keycombo>.
ru: В ином случае эта комбинация клавиш будет работать так же, как <keycombo><keycap>Ctrl</keycap><keycap>u</keycap></keycombo>.

source: Open the Main window of <application>StarDict</application>. The Main window may be iconified, or <application>StarDict</application> may only exist as a Notification area icon. In all the cases pressing this hotkey presents the Main window to the user. You may change the hotkey in the Preferences dialog, see <xref linkend="stardict-prefs-main-window-options"/>.
ru: Открыть главное окно <application>StarDict</application>. Главное окно может быть свёрнуто, или же <application>StarDict</application> может существовать только в виде значка в области уведомлений. Нажатие этой комбинации клавиш в любом случае приведёт к тому, что пользователю будет показано главное окно. Её можно изменить в диалоге настройки, см. <xref linkend="stardict-prefs-main-window-options"/>.

source: Toggle the Scan mode. You may change the hotkey in the Preferences dialog, see <xref linkend="stardict-prefs-dictionary-scan"/>.
ru: Переключить режим сканирования. Эту комбинацию клавиш можно изменить в диалоге настройки, см. <xref linkend="stardict-prefs-dictionary-scan"/>.

source: To configure <application>StarDict</application>, click the <guibutton>Preferences</guibutton> button at the right-bottom corner of the Main window or click the <guibutton>Main menu</guibutton> button and choose <guimenuitem>Preferences</guimenuitem>.
ru: Для настройки <application>StarDict</application> нажмите кнопку <guibutton>Настройка</guibutton>, расположенную в правом нижнем углу главного окна, или кнопку <guibutton>Главное меню</guibutton> и выберите пункт <guimenuitem>Настройка</guimenuitem>.

source: Scan Selection
ru: Сканирование выделенного

source: Only scan while modifier key is being pressed.
ru: Сканировать, только если нажата клавиша-модификатор

source: Only do scanning while the modifier key being pressed. The modifier key is set by the <xref linkend="stardict-prefs-dictionary-scan" endterm="stardict-prefs-dictionary-scan-scan-key"/> option.
ru: Сканировать только при нажатии клавиши-модификатора. Модификатор задаётся параметром <xref linkend="stardict-prefs-dictionary-scan" endterm="stardict-prefs-dictionary-scan-scan-key"/>.

source: Default: FALSE.
ru: По умолчанию: отключено.

source: Hide floating window when modifier key released.
ru: Скрывать всплывающее окно, когда клавиша-модификатор отпущена

source: When this option is set, the Floating window is hidden when user releases the modifier key. Note: the window is hidden only if the pointer has the same position it had when the window was shown. In addition to hiding the window, the last selected text is forgotten, which allow you to lookup the same text again simply pressing the modifier key. When this option is not set, releasing the modifier key has no effect on the Floating window.
ru: Если этот параметр включён, всплывающее окно скрывается, когда пользователь отпускает клавишу-модификатор. Примечание: окно скрывается только в том случае, если указатель мыши находится в том же положении, что и во время показа окна. Программа не только скрывает окно, но и забывает последний выделенный текст; это позволяет повторить его поиск путём нажатия клавиши-модификатора. Если этот параметр отключён, отпускание клавиши-модификатора не влияет на всплывающее окно.

source: This option has effect only if <xref linkend="stardict-prefs-dictionary-scan" endterm="stardict-prefs-dictionary-scan-scan-when-modifier"/> is checked.
ru: Этот параметр работает только в том случае, если установлен флажок <xref linkend="stardict-prefs-dictionary-scan" endterm="stardict-prefs-dictionary-scan-scan-when-modifier"/>.

source: Default: TRUE.
ru: По умолчанию: включено.

source: Scan modifier key
ru: Клавиша-модификатор сканирования

source: This option allows to choose a modifier keys or a key combination that enables scanning.
ru: Этот параметр позволяет выбрать клавишу-модификатор или комбинацию клавиш для включения сканирования.

source: Default key: <keycap>Win</keycap> (depends on <application>StarDict</application> edition).
ru: Клавиша по умолчанию: <keycap>Win</keycap> (зависит от версии <application>StarDict</application>).

source: Scan clipboard.
ru: Сканировать содержимое буфера обмена

source: Enables Clipboard scanning. If enabled, when new text is copied into the clipboard, <application>StarDict</application> lookup the text into the Floating window.
ru: Включает сканирование содержимого буфера обмена. Если флажок установлен, при копировании нового текста в буфер обмена <application>StarDict</application> будет выполнять поиск этого текста во всплывающем окне.

source: This option is only available in <emphasis>Windows edition</emphasis> of <application>StarDict</application>.
ru: Этот параметр доступен только в <emphasis>Windows-версии</emphasis> <application>StarDict</application>.

source: Scan mode shortcut
ru: Комбинация клавиш режима сканирования

source: The Scan mode shortcut enables or disables the Scan mode. Check the <guilabel>Use scan hotkey</guilabel> checkbox to enable this shortcut. You may change the shortcut in the field to the right of the label. Click inside the field and press the key combination you want to assign to this action.
ru: Комбинация клавиш режима сканирования включает или отключает этот режим. Для её использования необходимо установить флажок <guilabel>Использовать комбинацию клавиш для включения или отключения сканирования</guilabel>. Её можно изменить в поле, расположенном справа от названия флажка. Щёлкните в пределах поля и нажмите ту комбинацию клавиш, которую следует назначить.

source: Default: TRUE
ru: По умолчанию: включено.

source: Default shortcut: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>x</keycap></keycombo>.
ru: Комбинация клавиш по умолчанию: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>x</keycap></keycombo>.

source: Font
ru: Шрифт

source: Use custom font.
ru: Использовать свой шрифт

source: Allows you to override the system's default for <application>StarDict</application>. If this option is turned on, the font selelected in the <guilabel>Dictionary font</guilabel> option will be used instead of the system font.
ru: Позволяет переопределить системный шрифт по умолчанию для <application>StarDict</application>. Если этот параметр включён, вместо системного шрифта будет использоваться шрифт, заданный с помощью параметра <guilabel>Шрифт словаря</guilabel>.

source: Font settings apply immediately.
ru: Параметры шрифта применяются сразу же.

source: Cache
ru: Кэш

source: Create cache files to speed up loading.
ru: Создать файлы кэша для ускорения загрузки.

source: Opening a dictionary the first time, <application>StarDict</application> does some calculations to access dictionary contents speedily. <application>StarDict</application> may save the results in special cache files that will be used the next time <application>StarDict</application> starts. With cache files <application>StarDict</application> starts quicker, since it does not need to do the same calculations again. It's highly recommended to enable caching. In the first place, <application>StarDict</application> tries to save a cache file along with the dictionary. If it fails, for example, because the directory is write-protected, <application>StarDict</application> creates a file under the user home directory, in <application>StarDict</application>'s directory.
ru: Когда словарь отрывается в первый раз, <application>StarDict</application> выполняет некоторые вычисления для ускорения доступа к его содержимому. <application>StarDict</application> может сохранить результаты в специальных файлах кэша, которые будут использоваться при следующем запуске <application>StarDict</application>. Благодаря файлам кэша запуск <application>StarDict</application> выполняется быстрее, так как программе не нужно снова выполнять те же самые вычисления. Настоятельно рекомендуется включить функцию кэширования. Сначала <application>StarDict</application> попытается сохранить файл кэша вместе со словарём. Если это не получится сделать (например, из-за того, что каталог защищён от записи), <application>StarDict</application> создаст файл в домашнем каталоге пользователя, в каталоге <application>StarDict</application>.

source: Sort word list by collation function.
ru: Сортировать список слов с помощью функции сравнения

source: Normally, <application>StarDict</application> uses an index of words to look up a word in a dictionary. When the word is present in the index, the corresponding article is shown. Otherwise adjacent words will be checked and may be used as result. <application>StarDict</application> uses heuristic algorithms to decide whether the particular word may be suggested as result of the search or not. The order of words in an index is very important and it would be handy if index items were sorted by alphabet or according to other rules. Collation functions allows you to specify a number of predefined sorting orders, that may be helpful when working with particular languages.
ru: Обычно <application>StarDict</application> использует индекс слов для поиска слова в словаре. Когда слово имеется в индексе, показывается соответствующая статья. В ином случае проверяются соседние слова, они могут быть использованы в качестве результата. <application>StarDict</application> использует эвристические алгоритмы для принятия решения о том, можно ли предложить определённое слово в качестве результата поиска. Порядок слов в индексе очень важен; полезна упорядоченность элементов индекса по алфавиту или в соответствии с другими правилами. Функции сравнения позволяют указать ряд предустановленных порядков сортировки, что может быть полезным при работе с определёнными языками.

source: To use a collation function check the <guilabel>Sort word list by collation function</guilabel> checkbox and select the desired function from the <guilabel>Collation function</guilabel> list. The collation function will be applied as soon as you close the Preferences dialog. It may take a considerable amount of time to apply the new collation function, please, be patient.
ru: Чтобы использовать функцию сравнения, установите флажок <guilabel>Сортировать список слов с помощью функции сравнения</guilabel> и выберите нужную функцию в списке <guilabel>Функция сравнения</guilabel>. Функция сравнения будет применена сразу после закрытия диалогового окна настройки. Будьте готовы к тому, что на применение новой функции сравнения может потребоваться достаточно много времени.

source: It's highly recommended to enable the <xref linkend="stardict-prefs-dictionary-cache" endterm="stardict-prefs-dictionary-scan-create-cache-files"/> option, otherwise <application>StarDict</application> will do sorting each time the application starts.
ru: Настоятельно рекомендуется включить параметр <xref linkend="stardict-prefs-dictionary-cache" endterm="stardict-prefs-dictionary-scan-create-cache-files"/>, чтобы <application>StarDict</application> не приходилось выполнять сортировку при каждом запуске программы.

source: Clean all cache files
ru: Очистить кэш

source: Remove all <application>StarDict</application> cache files.
ru: Удалить все файлы кэша <application>StarDict</application>.

source: Export
ru: Экспорт

source: <application>StarDict</application> may export search results into a file. You have two options: export only the found word or export the entire search result, the contents of the Definition area.
ru: <application>StarDict</application> может экспортировать результаты поиска в файл. Есть два варианта: экспортировать только найденное слово или экспортировать результат поиска целиком (т.е. всё содержимое области определений).

source: Only export words.
ru: Экспортировать только слова

source: When this option is set, <application>StarDict</application> exports only the found word, otherwise exports the complete article.
ru: Если этот параметр включён, <application>StarDict</application> выполняет экспорт только найденного слова, в ином случае — экспорт всей статьи.

source: File name
ru: Имя файла

source: Name of the file where to export data.
ru: Имя файла, в который следует экспортировать данные.

source: Sound
ru: Звук

source: There are a number of cases when <application>StarDict</application> needs to play sound files. <application>StarDict</application> may accompany GUI actions with sounds. <application>StarDict</application> may pronounce the words you search in the dictionary. Some articles may contain linked sound files you can play.
ru: В ряде случаев <application>StarDict</application> требуется воспроизводить звуковые файлы. <application>StarDict</application> может сопровождать звуками действия в графическом интерфейсе пользователя. <application>StarDict</application> может произносить слова, поиск которых выполняется в словаре. Некоторые статьи могут содержать ссылки на звуковые файлы — их можно воспроизводить.

source: To play sound files <application>StarDict</application> may harness platform-specific services or use commands you specify on this page.
ru: Для воспроизведения звуковых файлов <application>StarDict</application> может задействовать заданные платформой службы или же использовать команды, которые указаны пользователем на этой странице.

source: This page allows to configure some aspects of the TTS subsystem. The TTS subsystem is used to pronounce words by computer.
ru: На этой странице можно настроить некоторые параметры подсистемы синтеза речи. Она используется для произнесения слов компьютером.

source: Enable sound event.
ru: Использовать звуки для событий

source: Whether to enable sound events. <application>StarDict</application> will play sound event when button is active, released, and when a menu pops up.
ru: Следует ли включить звуки для событий. <application>StarDict</application> будет воспроизводить звуки при использовании кнопок и появлении меню.

source: Command for playing sound files:
ru: Команда для воспроизведения звуковых файлов

source: Specifies a command for playing sound files. You may specify a program name (with or without full path) accompaned with any options required. The file name to play will be appended to this command at run time.
ru: Указывает команду для воспроизведения звуковых файлов. Можно указать имя программы (с полным путём или без него) и любые необходимые параметры. Имя файла для воспроизведения будет добавлено к этой команде во время выполнения.

source: Always use sound play command
ru: Всегда использовать команду воспроизведения звуков

source: On some platforms <application>StarDict</application> use platform-specific services to play sound files first, then retreats to the custom command provided by the user if the service is unable to play the file. You may specify to always use the custom command selecting this option.
ru: На некоторых платформах <application>StarDict</application> сначала задействует заданные ими службы для воспроизведения звуковых файлов, а затем (если службе не удалось воспроизвести файл) использует предоставленную пользователем команду. Установка этого флажка позволяет указать программе, что следует всегда использовать пользовательскую команду.

source: RealPeopleTTS search path:
ru: Каталоги со звуковыми файлами произношений слов:

source: Allows to specify locations of RealPeopleTTS bundles. RealPeopleTTS bundle is a collection of sound files containing speech samples performed by real people. Normally, one file contains one recoded word, the file is named after that word. Sound files are organized into a number of directories. In the text field you must specify a path to the top level directory of the bundle. The order of paths in the text field is important. <application>StarDict</application> checks directories from top to bottom, the first found file will be used.
ru: Позволяет указать каталоги с наборами файлов произношений слов. Эти звуковые файлы содержат образцы речи, начитанные реальными людьми. Обычно в одном файле записано одно слово, при этом название файла совпадает с ним. Звуковые файлы распределены по каталогам. В поле ввода необходимо указать путь к каталогу верхнего уровня. Порядок указания путей в поле ввода имеет значение. <application>StarDict</application> проверяет каталоги сверху вниз, используется первый найденный файл.

source: Default:
ru: По умолчанию

source: In Windows edition of <application>StarDict</application>
ru: В версии <application>StarDict</application> для Windows

source: In other editions of <application>StarDict</application>
ru: В других версиях <application>StarDict</application>

source: Enable TTS program.
ru: Использовать программу синтеза речи

source: Allows to use the command below to read words. You need to restart <application>StarDict</application> for changes to take effect.
ru: Разрешает использовать указанную ниже команду для чтения слов. Чтобы изменения вступили в силу, необходимо перезапустить <application>StarDict</application>.

source: TTS <guilabel>Command line:</guilabel>
ru: <guilabel>Команда</guilabel>

source: This field allows to specify a command to use to pronounce words. You need to provide a print-like string, with "%s" specifing the place where the word (or phrase) to pronounce will be inserted. You need to restart <application>StarDict</application> for changes to take effect. Do not forget to check the checkbox above if you want to use this command.
ru: В этом поле можно указать команду, которую следует использовать для произнесения слов. Необходимо предоставить строку, где «%s» указывает место для вставки произносимого слова (или фразы). Чтобы изменения вступили в силу, необходимо перезапустить <application>StarDict</application>. Не забудьте установить флажок выше, если требуется использовать эту команду.

source: Default: <emphasis>nothing</emphasis>.
ru: По умолчанию: <emphasis>ничего</emphasis>.
