Repository: huzheng001/stardict-3.0.6.2
Catalog: dict/help/*/*.po
Languages: ru

source: Activate portable mode, see <xref linkend="stardict-portable"/>. Specifying the option is not enough to make <application>StarDict</application> to be <application>StarDict Portable</application>. You should avoid using this option unless you know what you are doing.
ru: Включить мобильный режим, см. <xref linkend="stardict-portable"/>. Указания этой опции недостаточно для того, чтобы превратить <application>StarDict</application> в <application>StarDict Portable</application>. Пользоваться этой опцией можно только при условии полного понимания принципов её работы.

source: Dictionary Management
ru: Управление словарями

source: To manage the dictionaries, click the <guibutton>Manage dictionaries</guibutton> button at the bottom-right corner of the Main window, or click the <guibutton>Main menu</guibutton> button and choose <guimenuitem>Dict manage</guimenuitem>.
ru: Для управления словарями нажмите кнопку <guibutton>Управление словарями</guibutton>, расположенную в правом нижнем углу главного окна, или нажмите кнопку <guibutton>Главное меню</guibutton> и выберите пункт <guimenuitem>Управление словарями</guimenuitem>.

source: In the dictionary management dialog, you can disable dictionaries that you don't need, and you can set the order in which the dictonaries are queried.
ru: В диалоге управления словарями можно отключить ненужные словари, а также установить порядок, в котором словари будут опрашиваться.

source: <application>StarDict</application> will search the dictionary files at "~/.stardict/dic" and "/usr/share/stardict/dic", and search tree dictionary files at "~/.stardict/treedict" and "/usr/share/stardict/treedict"
ru: <application>StarDict</application> ищет файлы словарей в каталогах «~/.stardict/dic» и «/usr/share/stardict/dic», а файлы древовидных словарей — в каталогах «~/.stardict/treedict» и «/usr/share/stardict/treedict»

source: Help
ru: Справка

source: Inside <application>StarDict</application> you may open documentation either by pressing the <keycombo><keycap>F1</keycap></keycombo> key or by clicking the <guibutton>Main menu</guibutton> button, then the <guimenuitem>Help</guimenuitem> item in the popup menu. <application>StarDict</application> documentation has different formats depending on application edition. The primary documentation format is DocBook. <application>StarDict</application> installs documentation in DocBook format only in Gnome edition. In this edition documentation seamlessly integrates with Gnome documentation system. It can be read through <application>Help Browser</application>. Documentation was translated into a number of languages. You are presented with localized version if it's available. Gnome allows to configure the prefered language.
ru: Чтобы открыть документацию в приложении <application>StarDict</application>, следует либо нажать клавишу <keycombo><keycap>F1</keycap></keycombo>, либо щёлкнуть по кнопке <guibutton>Главное меню</guibutton> и выбрать во всплывающем меню пункт <guimenuitem>Справка</guimenuitem>. Формат документации <application>StarDict</application> зависит от версии приложения. Основным форматом документации является DocBook. <application>StarDict</application> устанавливает документацию в формате DocBook только в версии для Gnome. В этой версии документация интегрируется в систему документации Gnome. Чтение документации можно выполнить с помощью <application>Браузера справки</application>. Документация была переведена на несколько языков; пользователю будет показана локализованная версия (если она доступна). Gnome позволяет настроить предпочитаемый язык.

source: In other editions of <application>StarDict</application> documentation is available in html format. You need to configure Web browser to view documentation, see <xref linkend="stardict-prefs-network-web-browser"/>. Choosing documentation language, <application>StarDict</application> roughly follows gettext package locale selection algorithm. The LANGUAGE enviroment variable is checked first. It's expected to contain a list of language codes in the order of preference. If the LANGUAGE variable is not set, the current locale is inspected. Finally, if documentation in prefered languages is not available, the english documentation is shown.
ru: В других версиях <application>StarDict</application> документация доступна в формате HTML. Потребуется настроить веб-браузер для просмотра документации, см. <xref linkend="stardict-prefs-network-web-browser"/>. При выборе языка документации <application>StarDict</application> в общих чертах следует алгоритму выбора локали пакета gettext. Сначала проверяется переменная среды LANGUAGE. Ожидается, что она будет содержать список кодов языков в порядке приоритета. Если переменная LANGUAGE не установлена, рассматривается текущая локаль. Наконец, если документация на предпочитаемых языках недоступна, отображается документация на английском.

source: In Windows edition of <application>StarDict</application> the default language corresponds to the language selected in the <guilabel>Regional and Language Options</guilabel> dialog.
ru: В Windows-версии <application>StarDict</application> язык по умолчанию соответствует тому языку, который выбран в диалоге <guilabel>Язык и региональные стандарты</guilabel>.

source: Changing default language
ru: Изменение языка по умолчанию

source: Open <guilabel>Control Panel</guilabel>, <guilabel>Regional and Language Options</guilabel>. <guilabel>Regional and Language Options</guilabel> dialog pops up. On the <guilabel>Regional Options</guilabel> tab select a language in the <guilabel>Stardards and formats</guilabel> group.
ru: Откройте <guilabel>Панель управления</guilabel>, <guilabel>Язык и региональные стандарты</guilabel>. Появится диалоговое окно <guilabel>Язык и региональные стандарты</guilabel>. Перейдите на вкладку <guilabel>Региональные параметры</guilabel> и выберите язык в группе параметров <guilabel>Стандарты и форматы</guilabel>.

source: You may override the default language with the LANGUAGE environment variable.
ru: Переопределить язык по умолчанию можно с помощью переменной среды LANGUAGE.

source: Normally, help files can be found in the <filename>C:\Program Files\StarDict\help</filename> directory. Each directory corresponds to one language. Directories are named after language codes.
ru: Обычно файлы справки находятся в каталоге <filename>C:\Program Files\StarDict\help</filename>. Каждый каталог соответствует одному языку. Названия каталогов совпадают с кодами языков.

source: StarDict directories
ru: Каталоги StarDict

source: <application>StarDict</application> uses a number of directories to store application data, load and save configuration settings. Default directories are assigned at build time, but some of them can be overriden with <filename>stardict-dirs.cfg</filename> file. Overriding StarDict directories is useful for debugging, preparing special configurations like StarDict-portable for Windows, an ordinary user does not need this.
ru: <application>StarDict</application> использует несколько каталогов для хранения данных приложения, загрузки и сохранения параметров конфигурации. Каталоги по умолчанию назначаются во время сборки, но некоторые из них можно переопределить с помощью файла <filename>stardict-dirs.cfg</filename>. Переопределение каталогов StarDict может быть полезным, если нужно выполнить отладку или подготовить специальные конфигурации (такие, как StarDict-portable для Windows); обычному пользователю это не требуется.

source: <application>StarDict</application> searches for the <filename>stardict-dirs.cfg</filename> file in the <varname>user_config_dir</varname> directory. You may override location of the <filename>stardict-dirs.cfg</filename> file with <varname>STARDICT_DIRS_CONFIG_FILE</varname> environment variable or with <parameter class="command">--dirs-config</parameter> command line option. Command line option takes the highest precedence, then the environment variable is inspected, and finally the file in the <varname>user_config_dir</varname> directory. The first specified file wins, it will be probed as a configuration file. If load fails, no other files will be tried.
ru: <application>StarDict</application> ищет файл <filename>stardict-dirs.cfg</filename> в каталоге <varname>user_config_dir</varname>. Расположение файла <filename>stardict-dirs.cfg</filename> можно переопределить с помощью переменной среды <varname>STARDICT_DIRS_CONFIG_FILE</varname> или параметра командной строки <parameter class="command">--dirs-config</parameter>. Параметр командной строки обладает наивысшим приоритетом, за ним следует переменная среды, далее — файл в каталоге <varname>user_config_dir</varname>. В качестве файла конфигурации будет использован первый указанный файл. В случае сбоя загрузки программа не будет пытаться использовать другие файлы.

source: The <filename>stardict-dirs.cfg</filename> file is a .ini-like config file. The syntax of .ini files is described in detail in the <ulink url="http://freedesktop.org/wiki/Specifications/desktop-entry-spec">Desktop Entry Specification</ulink>. All keys must belong to <quote>general</quote> group.
ru: Файл <filename>stardict-dirs.cfg</filename> похож на конфигурационный файл .ini. Синтаксис файлов .ini подробно описывается здесь: <ulink url="http://freedesktop.org/wiki/Specifications/desktop-entry-spec">Desktop Entry Specification</ulink>. Все ключи должны принадлежать группе <quote>general</quote>.

source: Do not forget to double backslash characters in values. Backslash is used as path separator in Windows.
ru: Не забудьте продублировать символы обратной косой черты в значениях. В Windows обратная косая черта используется в качестве разделителя пути.

source: Example of <filename>stardict-dirs.cfg</filename> file for Windows: <placeholder-1/>
ru: Пример файла <filename>stardict-dirs.cfg</filename> для Windows: <placeholder-1/>

source: A directory of configuration files.
ru: Каталог с файлами конфигурации.

source: Windows default: <filename>C:\Documents and Settings\%USERNAME%\Application Data\StarDict</filename>.
ru: Значение по умолчанию для Windows: <filename>C:\Documents and Settings\%USERNAME%\Application Data\StarDict</filename>.

source: Other default: <filename>~/.stardict</filename>.
ru: Значение по умолчанию для других операционных систем: <filename>~/.stardict</filename>.

source: Environment variable: <varname>STARDICT_CONFIG_PATH</varname>.
ru: Переменная среды: <varname>STARDICT_CONFIG_PATH</varname>.

source: <filename>stardict-dirs.cfg</filename> key: user_config_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: user_config_dir.

source: User cache directory.
ru: Каталог пользовательского кэша.

source: Windows default: <filename>C:\Documents and Settings\%USERNAME%\Temporary Internet Files\stardict</filename>.
ru: Значение по умолчанию для Windows: <filename>C:\Documents and Settings\%USERNAME%\Temporary Internet Files\stardict</filename>.

source: Other default: <filename>~/.cache/stardict</filename>.
ru: Значение по умолчанию для других операционных систем: <filename>~/.cache/stardict</filename>.

source: <filename>stardict-dirs.cfg</filename> key: user_cache_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: user_cache_dir.

source: Data directory.
ru: Каталог данных.

source: Windows default: <filename>C:\Program Files\StarDict</filename>.
ru: Значение по умолчанию для Windows: <filename>C:\Program Files\StarDict</filename>.

source: Other default: <filename>/usr/share/stardict</filename>.
ru: Значение по умолчанию для других операционных систем: <filename>/usr/share/stardict</filename>.

source: <filename>stardict-dirs.cfg</filename> key: data_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: data_dir.

source: A directory of hook dlls, in Windows edition only.
ru: Каталог с dll обработчика, только в версии для Windows.

source: Windows default: <varname>data_dir</varname>.
ru: Значение по умолчанию для Windows: <varname>data_dir</varname>.

source: <filename>stardict-dirs.cfg</filename> key: dll_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: dll_dir.

source: A directory of StarDict plugins.
ru: Каталог с модулями StarDict.

source: Windows default: <varname>data_dir</varname> + <filename>"/plugins"</filename>.
ru: Значение по умолчанию для Windows: <varname>data_dir</varname> + <filename>"/plugins"</filename>.

source: Other default: <filename>/usr/lib/stardict/plugins</filename>.
ru: Значение по умолчанию для других операционных систем: <filename>/usr/lib/stardict/plugins</filename>.

source: <filename>stardict-dirs.cfg</filename> key: plugins_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: plugins_dir.

source: A directory of help files, in all editions except Gnome edition.
ru: Каталог с файлами справки, во всех версиях, за исключением версии для Gnome.

source: Default: <varname>data_dir</varname> + <filename>"/help"</filename>.
ru: По умолчанию: <varname>data_dir</varname> + <filename>"/help"</filename>.

source: <filename>stardict-dirs.cfg</filename> key: help_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: help_dir.

source: A directory for log files.
ru: Каталог для файлов журнала.

source: Windows default: <filename>C:\Documents and Settings\%USERNAME%\Local Settings\Temp\StarDict</filename>.
ru: Значение по умолчанию для Windows: <filename>C:\Documents and Settings\%USERNAME%\Local Settings\Temp\StarDict</filename>.

source: Other default: <filename>/var/tmp/stardict</filename>.
ru: Значение по умолчанию для других операционных систем: <filename>/var/tmp/stardict</filename>.

source: <filename>stardict-dirs.cfg</filename> key: log_dir.
ru: Ключ <filename>stardict-dirs.cfg</filename>: log_dir.

source: Default values in the list above are given for the purpose of illustrating possible values of variables. Actual default value depends on a number of factors and cannot be computed easily. See AppDirs class in the <filename>conf.h</filename> file for details on how the default value is calculated.
ru: Значения по умолчанию в списке выше приведены в иллюстративных целях — чтобы показать возможные значения переменных. Фактическое значение по умолчанию зависит от ряда факторов, его не так просто вычислить. Чтобы узнать, как вычисляется значение по умолчанию, посмотрите на класс AppDirs в файле <filename>conf.h</filename>.

source: Logging
ru: Журналирование

source: <application>StarDict</application> may log messages into a file. By default logging is turned off, you may enable it specifing non-zero log level with <parameter class="command">--log-level</parameter> command line option, see <xref linkend="stardict-details-command-line"/>.
ru: <application>StarDict</application> может записывать сообщения в файл. По умолчанию журналирование отключено. Его можно включить, указав отличный от нуля уровень журналирования с помощью параметра командной строки <parameter class="command">--log-level</parameter> (см. <xref linkend="stardict-details-command-line"/>).

source: By default messages are printed on to console, log file may be useful if console is not available like in Windows. Log may be useful in troubleshooting startup problems.
ru: По умолчанию сообщения выводятся в консоли. Файл журнала может быть полезен, если консоль недоступна (как в Windows), а также при устранении проблем с запуском.

source: For default location of the log directory see <xref linkend="stardict-details-dirs"/>, log_dir parameter. <application>StarDict</application> log files are named like <filename>stardict-<replaceable>process_number</replaceable>.log</filename>. We need to use process numbers to create unique log files, since multiple <application>StarDict</application> instances may run at the same time. To find the log file belonging to the most recently started instance of <application>StarDict</application>, consider file creation time.
ru: Сведения о стандартном расположении каталога с журналом доступны в разделе <xref linkend="stardict-details-dirs"/> (параметр log_dir). Файлы журнала <application>StarDict</application> имеют названия вида <filename>stardict-<replaceable>номер_процесса</replaceable>.log</filename>. Номера процессов нужны для создания уникальных файлов журнала, так как одновременно могут работать несколько экземпляров <application>StarDict</application>. Чтобы найти файл журнала, относящийся к последнему запущенному экземпляру <application>StarDict</application>, обратите внимание на время создания файла.

source: Interface language
ru: Язык интерфейса

source: This section describes the algorithm used to select interface language in <application>StarDict</application>.
ru: В этом разделе описывается алгоритм, используемый для выбора языка интерфейса в <application>StarDict</application>.

source: Retrieve <varname>STARDICTLANG</varname> environment variable. Goto <xref linkend="GUILangSetLANG"/> if the variable is defined.
ru: Извлечь переменную среды <varname>STARDICTLANG</varname>. Перейти к <xref linkend="GUILangSetLANG"/>, если переменная определена.

source: Retrieve the user default locale (to set the default locale: <menuchoice><guibutton>Control Panel</guibutton><guibutton>Regional and Language Options</guibutton><guibutton>Regional Options</guibutton><guilabel>Standards and formats</guilabel><guilabel>Language</guilabel></menuchoice>). If locale is not defined, use "en".
ru: Извлечь стандартную локаль пользователя (чтобы установить локаль по умолчанию: <menuchoice><guibutton>Панель управления</guibutton><guibutton>Язык и региональные стандарты</guibutton><guibutton>Региональные параметры</guibutton><guilabel>Стандарты и форматы</guilabel><guilabel>Язык</guilabel></menuchoice>). Если локаль не определена, использовать «en».

source: Assign the language code to the <varname>LANG</varname> environment variable.
ru: Назначить код языка переменной среды <varname>LANG</varname>.

source: Retrieve the value of the environment variable <varname>LANGUAGE</varname>. This is a GNU extension. Its value can be a colon-separated list of locale names. If defined, goto <xref linkend="GUILangAvailableTransl"/>.
ru: Извлечь значение переменной среды <varname>LANGUAGE</varname>. Это расширение GNU. Значение может представлять собой разделённый двоеточиями список имён локалей. Если переменная определена, перейти к <xref linkend="GUILangAvailableTransl"/>.

source: The value of the environment variable <varname>LC_ALL</varname>, <varname>LC_xxx</varname>, or <varname>LANG</varname>. More precisely, the first among these that is set to a non-empty value. This is how POSIX specifies it. The value is a single locale name. If defined, goto <xref linkend="GUILangAvailableTransl"/>.
ru: Значение переменной среды <varname>LC_ALL</varname>, <varname>LC_xxx</varname> или <varname>LANG</varname>. Точнее, первой из этих переменных, которая установлена в непустое значение. Так это определяется в POSIX. Значение представляет собой имя одной локали. Если определено, перейти к <xref linkend="GUILangAvailableTransl"/>.

source: A system-dependent preference list of languages. Its value can be a colon-separated list of locale names. If defined, goto <xref linkend="GUILangAvailableTransl"/>.
ru: Зависящий от системы список предпочитаемых языков. Его значением может быть разделённый двоеточиями список имён локалей. Если определено, перейти к <xref linkend="GUILangAvailableTransl"/>.

source: A system-dependent default locale name. If defined, goto <xref linkend="GUILangAvailableTransl"/>.
ru: Зависящее от системы имя стандартной локали. Если определено, перейти к <xref linkend="GUILangAvailableTransl"/>.

source: Processes the found value as a colon-separated list of language codes. Select the first available language. If none is available, select no translation.
ru: Обработать найденное значение как разделённый двоеточиями список кодов языков. Выбрать первый доступный язык. Если доступных языков нет, не выбирать перевод.

source: Steps <xref linkend="GUILangGetLANGUAGE"/> through <xref linkend="GUILangAvailableTransl"/> describe translation selection algorithm of the gettext package. The actual procedure may be different.
ru: Шаги с <xref linkend="GUILangGetLANGUAGE"/> по <xref linkend="GUILangAvailableTransl"/> описывают алгоритм выбора перевода пакета gettext. Фактическая процедура может отличаться.

source: The best way to specify interface language of <application>StarDict</application> is to define <varname>STARDICTLANG</varname> environment variable. It should contain language code. See <filename class="directory">$StarDictDataDir/locale</filename> for the list of supported languages.
ru: Наилучший способ указать язык интерфейса <application>StarDict</application> — определить переменную среды <varname>STARDICTLANG</varname>. Она должна содержать код языка. Список поддерживаемых языков доступен в <filename class="directory">$StarDictDataDir/locale</filename>.

source: <application>StarDict Portable</application> is special edition of <application>StarDict</application> for Windows that works with any hardware you like (USB flash drive, portable hard drive, etc). Now you can carry <application>StarDict</application> along with all settings with you. Use them on any Windows computer. All personal data are saved along with application.
ru: <application>StarDict Portable</application> — специальная версия <application>StarDict</application> для Windows, которая работает с любым аппаратным обеспечением (USB-устройство флэш-памяти, переносной жёсткий диск и т.д.). Теперь программу <application>StarDict</application> вместе со всеми её настройками можно носить с собой и использовать на любом компьютере под управлением Windows. Вместе с программой сохраняются и все личные данные.

source: <application>StarDict Portable</application> relies on the <ulink url="http://portableapps.com" type="http">PortableApps.com Platform</ulink>. It provides convenient shell to start and configure portable applications. On the screenshot below you may see PortableApps.com menu with <application>StarDict Portable</application> and <application>StarDict Editor portable</application>. You may change interface language of the menu and <application>StarDict Portable</application>. To do that click <menuchoice><guibutton>Options</guibutton><guimenu>Language</guimenu></menuchoice> and select the desired language.
ru: <application>StarDict Portable</application> опирается на <ulink url="http://portableapps.com" type="http">платформу PortableApps.com</ulink>. Она предоставляет удобную оболочку для запуска и настройки переносимых приложений. На снимке экрана ниже показано меню PortableApps.com со <application>StarDict Portable</application> и <application>StarDict Editor Portable</application>. Можно изменить язык интерфейса меню и <application>StarDict Portable</application>. Для этого выберите пункт <menuchoice><guibutton>Настройки</guibutton><guimenu>Язык</guimenu></menuchoice> и укажите нужный язык.

source: PortableApps.com menu
ru: Меню PortableApps.com

source: PortableApps.com menu with <application>StarDict Portable</application>.
ru: Меню PortableApps.com со <application>StarDict Portable</application>.

source: Differences from non-portable version
ru: Отличия от непереносимой версии

source: Functionality of <application>StarDict Portable</application> is almost identical to the non-portable version. Only features that ties application to the specific machine are disabled. The list below details the deferences.
ru: Функциональность <application>StarDict Portable</application> почти идентична функциональности непереносимой версии. Отключены только те возможности, которые привязывают приложение к определённому компьютеру. Описание различий приводится в списке ниже.

source: StarDict Portable features
ru: Возможности StarDict Portable
