Repository: huzheng001/stardict-3.0.6.2
Catalog: dict/help/*/*.po
Languages: ru

source: In Windows the Scan mode works differently. It has nothing to do with selection in fact. <application>StarDict</application> extracts the text under the pointer when you pause the mouse for a while. Normally <application>StarDict</application> looks up a word under the pointer, if the pointer is not over a word, then words to the left and the right of the pointer are considered. It is time to say what <application>StarDict</application> considers as a word. <application>StarDict</application> gives a number of tries. First, it considers a word may include anything but spaces and punctuations; second, a word consisting of only letters; a word of lower case letters; a word of upper case letters; a capitalized word of letters. Finally, <application>StarDict</application> uses one of the tried word to find the longest prefix making a word. You may help <application>StarDict</application> to extract the right word or a part of a word selecting it. Although <application>StarDict</application> does not work with selections, selection may effect the text <application>StarDict</application> gets.
ru: В Windows режим сканирования работает иначе. Он никак не связан с выделением. <application>StarDict</application> извлекает расположенный под указателем мыши текст, когда перемещение мыши на время приостанавливается. Обычно <application>StarDict</application> выполняет поиск слова, находящегося под указателем. Если указатель расположен не над словом, выполняется поиск находящихся слева и справа от указателя слов. Стоит уточнить, что именно <application>StarDict</application> ищет как слово. <application>StarDict</application> выполняет ряд попыток. Сначала программа рассматривает слово, содержащее любые символы, кроме пробелов и знаков препинания; затем — любое слово, состоящее только из букв; слово из букв в нижнем регистре; слово из букв в верхнем регистре; слово из букв, начинающееся с прописной. В итоге <application>StarDict</application> использует одно из рассмотренных слов для нахождения самой длинной словообразующей приставки. Можно помочь <application>StarDict</application> извлечь правильное слово или часть слова, выполнив выделение. Хотя <application>StarDict</application> не работает с выделенными фрагментами, такое выделение может повлиять на результаты поиска с помощью <application>StarDict</application>.

source: Scanning in Windows may not work with some applications. For example, it's known that scanning does not work with <application>FireFox 3.x</application> and <application>Windows Console</application> (cmd.exe process). The scanning feature depends on the way application outputs text. If scanning does not work, you may harness another <application>StarDict</application> feature ‒ <firstterm>Clipboard scanning</firstterm>, see <xref linkend="stardict-prefs-dictionary-scan"/>.
ru: В Windows сканирование может не работать в некоторых приложениях. Например, известно, что сканирование не работает в <application>FireFox 3.x</application> и <application>Windows Console</application> (процесс cmd.exe). Функция сканирования зависит от того, каким образом приложение выводит текст. Если сканирование не работает, можно воспользоваться другой возможностью <application>StarDict</application> — <firstterm>Сканировать содержимое буфера обмена</firstterm>, см. <xref linkend="stardict-prefs-dictionary-scan"/>.

source: In Windows <application>StarDict</application> works specially with some applications. First, <application>StarDict</application> itself. To scan a word in <application>StarDict</application> Main window you need to select it. The Scan mode in <application>StarDict</application> Main window works exactly as it should in general case, the fact that it's Windows does not matter. You can not scan in other <application>StarDict</application> windows however.
ru: В Windows <application>StarDict</application> особым образом работает с несколькими приложениями. Во-первых, сама программа <application>StarDict</application>. Чтобы выполнить сканирование слова в главном окне <application>StarDict</application>, необходимо выбрать его. Режим сканирования в главном окне <application>StarDict</application> работает точно так, как он должен это делать в общем случае; то, что работа ведётся в Windows, не играет роли. Тем не менее, в других окнах <application>StarDict</application> выполнять сканирование нельзя.

source: Second, there is special plugin to scan in PDF documents, see <xref linkend="stardict-acrobat-plugin"/>.
ru: Во-вторых, имеется специальный подключаемый модуль для сканирования в PDF-документах, см. <xref linkend="stardict-acrobat-plugin"/>.

source: <application>StarDict</application> Floating Window
ru: Всплывающее окно <application>StarDict</application>

source: Shows <application>StarDict</application> the Floating window. Contains Tool buttons and Definition area.
ru: Показывает всплывающее окно <application>StarDict</application>. Содержит кнопки инструментов и область определений.

source: Usage tips
ru: Советы по использованию

source: You may drag the Floating window to move it.
ru: Всплывающее окно можно переместить с помощью перетаскивания.

source: The Floating window will disappear when you move your pointer some distance away.
ru: Всплывающее окно исчезает после перемещения указателя мыши на некоторое расстояние от окна.

source: You may configure <application>StarDict</application> so it will do scanning only when a special modifier key is held down. See <xref linkend="stardict-prefs-dictionary-scan"/>.
ru: <application>StarDict</application> можно настроить так, чтобы программы выполняла сканирование только при нажатии специальной клавиши-модификатора. См. <xref linkend="stardict-prefs-dictionary-scan"/>.

source: You may switch the Scan mode on and off by pressing the <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>x</keycap></keycombo> shortcut. See <xref linkend="stardict-prefs-dictionary-scan"/>.
ru: Режим сканирования можно включать и отключать путём нажатия комбинации клавиш <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>x</keycap></keycombo>. См. <xref linkend="stardict-prefs-dictionary-scan"/>.

source: <application>StarDict</application> remembers the last text looked up in the Floating window and will not lookup it again. If you need to see the translation again, you should lookup another word first (it's not enough to simply change selection) and then lookup the original word. Another possibility is to middle-click on the Notification area icon, <application>StarDict</application> will lookup the selection unconditionally.
ru: <application>StarDict</application> запоминает последний текст, поиск которого выполнялся во всплывающем окне, и не ищет его снова. Чтобы просмотреть перевод ещё раз, следует сначала выполнить поиск другого слова (недостаточно просто изменить выделение), а затем выполнить поиск исходного слова. Другой вариант — щёлкнуть средней кнопкой мыши по значку в области уведомлений; <application>StarDict</application> выполнит поиск выделенного текста без каких-либо дополнительных условий.

source: The <application>StarDict</application> Floating window consists of the following elements:
ru: Всплывающее окно <guilabel>StarDict</guilabel> содержит следующие элементы:

source: Tool buttons bar
ru: Панель кнопок инструментов

source: A bar at the top of the Floating window. The bar will be hidden automatically to save display space. When your mouse pointer enters the Floating window, the Tool buttons bar will appear immediately, and disappear again as the mouse pointer leaves.
ru: Панель, расположенная в верхней части всплывающего окна. Она автоматически скрывается в целях экономии пространства для отображения. Когда указатель мыши наводится на всплывающее окно, панель кнопок инструментов немедленно появляется, а при прекращении наведения — скрывается вновь.

source: You can click these buttons to <guibutton>query</guibutton> a word in the Main window, <guibutton>copy</guibutton> the query result to clipboard, <guibutton>pronounce</guibutton> the word, <guibutton>stop</guibutton> selection scanning, etc. To the far right is the <guibutton>Lock floating window</guibutton> button. If the Floating window is locked, it will always be shown there.
ru: Эти кнопки могут использоваться для <guibutton>поиска</guibutton> слова в главном окне, <guibutton>копирования</guibutton> результата поиска в буфер обмена, <guibutton>произнесения</guibutton> слова, <guibutton>отключения</guibutton> сканирования выделенного и так далее. Самая правая кнопка — <guibutton>Закрепить всплывающее окно</guibutton>. Если всплывающее окно закреплено, оно всегда будет отображаться в этом месте.

source: The query result is displayed in this area.
ru: Результаты поиска отображаются в этой области.

source: WordPick Adobe Acrobat plugin
ru: Модуль WordPick Adobe Acrobat

source: <application>StarDict</application> includes an Abode Acrobat plugin that can be used to extract and translate text from Portable Document Format (PDF) documents. The WordPick plugin is available in Windows edition of <application>StarDict</application> only. The main text extration mechanism does not work with PDF documents in Windows.
ru: <application>StarDict</application> включает модуль Abode Acrobat, который можно использовать для извлечения и перевода текста из документов в формате PDF. Модуль WordPick доступен только в версии <application>StarDict</application> для Windows. Основной механизм извлечения текста не работает с PDF-документами в Windows.

source: Limitations
ru: Ограничения

source: WordPick plugin requires non-free edition of Acrobat like Acrobat Stardard, Pro or richer, it does not work with the free Acrobat Reader product. The plugin is know to work with versions 7-9 of Acrobat. PDF document security restrictions must allow extracting document content.
ru: Для работы модуля WordPick необходимо установить платное издание Acrobat (Acrobat Stardard, Pro или издание с большим количеством функций); модуль не будет работать с бесплатным продуктом Acrobat Reader. Модуль совместим с версиями 7-9 Acrobat. Параметры безопасности, установленные для PDF-документов, должны разрешать извлечение содержимого этих документов.

source: WordPick plugin embeds an icon into the stardard Acrobat toolbar near the Hand Tool. In Acrobat Reader you will not see that icon ‒ plugin is not available. If the current document does not allow for text extraction, the icon is disabled, the plugin is not operational.
ru: Модуль WordPick добавляет на стандартную панель инструментов Acrobat значок (рядом с инструментом «Рука»). В Acrobat Reader этот значок не появится — модуль не поддерживается. Если для текущего документа запрещено извлечение текста, значок будет неактивным; модуль не будет работать.

source: Adobe Acrobat Toolbar with WordPick plugin icon
ru: Панель инструментов Adobe Acrobat со значком модуля WordPick

source: Shows Adobe Acrobat Toolbar with WordPick plugin icon.
ru: Показывает панель инструментов Adobe Acrobat со значком модуля WordPick.

source: How to inspect document security permissions
ru: Изучение параметров безопасности документов

source: In the main menu open <guimenu>File</guimenu>, <guimenuitem>Document properties</guimenuitem>. <guilabel>Document properties</guilabel> dialog pops up. Proceed to <guilabel>Security</guilabel> tab. Look into <guilabel>Document Restrictions Summary</guilabel> group. <guilabel>Content Copying or Extraction</guilabel> must be allowed.
ru: Воспользуйтесь главным меню: <guimenu>Файл</guimenu>, <guimenuitem>Свойства документа</guimenuitem>. Появится диалоговое окно <guilabel>Свойства документа</guilabel>. Перейдите на вкладку <guilabel>Безопасность</guilabel>. Посмотрите на группу параметров <guilabel>Обзор ограничений документа</guilabel>. <guilabel>Копирование или извлечение содержимого</guilabel> должно быть разрешено.

source: Translate text with WordPick plugin
ru: Перевод текста с помощью модуля WordPick

source: Select WordPick and Select tools. Cursor changes to a vertical bar. Now you can select text with mouse.
ru: Выберите инструмент WordPick и инструмент выделения. Курсор превратится в вертикальную полоску. Теперь можно выделить текст с помощью мыши.

source: Start <application>StarDict</application> if you have not already done that, and enable Scan mode.
ru: Запустите <application>StarDict</application>, если программа ещё не запущена, и включите режим сканирования.

source: Select a word in the PDF document, <application>StarDict</application> shows the Floating window with translation if the word is found.
ru: После выделения слова в PDF-документе <application>StarDict</application> покажет всплывающее окно с переводом, если это слово было найдено.

source: You may select consecutive words and phrases. If <application>StarDict</application> is unable to find the phrase, it tries to cut words from the end. You will be shown translation of the first word if nothing else has been found.
ru: Можно выделять последовательности слов и фраз. Если <application>StarDict</application> не удалось найти указанную фразу, программа попытается убирать слова, начиная с конца. Если больше ничего не удастся найти, будет показан перевод первого слова.

source: Note that the Scan modifier key (<xref linkend="stardict-prefs-dictionary-scan"/>) has no effect in Acrobat. WordPick search for text when you select something in the document regardless of the state of modifiers. To turn off the text translation mode, deselect the WordPick tool on the toolbar, deselecting the Select tool is not necessary.
ru: Следует учитывать, что клавиша-модификатор сканирования (<xref linkend="stardict-prefs-dictionary-scan"/>) не работает в Acrobat. WordPick выполняет поиск текста при его выделении в документе независимо от того, нажата ли клавиша-модификатор. Чтобы отключить режим перевода текста, отмените выбор инструмента WordPick на панели инструментов (отменять выбор инструмента выделения необязательно).

source: <application>StarDict</application> provides full-text translation service. It allows you to translate short texts with up to 2000 characters approximately. The exact limit depends on the translation engine and other factors. To switch to Full-Text Translation mode click the <guilabel>Full-Text Translation</guilabel> button on the Left bar in <application>StarDict</application> Main window.
ru: <application>StarDict</application> позволяет выполнять полнотекстовый перевод. С помощью программы можно переводить короткие тексты (примерно до 2000 символов). Точные цифры зависят от системы перевода и других факторов. Чтобы перейти в режим полнотекстового перевода, нажмите кнопку <guilabel>Полнотекстовый перевод</guilabel> на левой панели в главном окне <application>StarDict</application>.

source: <application>StarDict</application> uses online translation services available for free on the Web to perform translation. <application>StarDict</application> collects text, source and target languages, constructs an HTTP request and sends it to online translation service. The application receives response of the service and shows results in a window. You may see <application>StarDict</application> interface to Full-Text Translation service below.
ru: Для выполнения перевода <application>StarDict</application> использует доступные в Интернете бесплатные онлайн-сервисы. <application>StarDict</application> собирает текст, исходный и целевой языки, создаёт HTTP-запрос и отправляет его онлайн-сервису перевода. Приложение получает ответ сервиса и отображает результат в окне. Ниже показан интерфейс <application>StarDict</application> к сервису полнотекстового перевода.

source: Full-Text Translation Mode
ru: Режим полнотекстового перевода

source: Shows <application>StarDict</application> in Full-Text Translation mode.
ru: Показывает <application>StarDict</application> в режиме полнотекстового перевода.

source: The top line of the window from left to right contains: engine selection combobox, source language combobox, and target language combobox. Below you see a text area for the text to translate. The bottom part of the window contains a text area for translation results. The <guilabel>Translate</guilabel> button in the middle of the window initiates translation request. The bottom line of the window provides a link to the online translation engine. It opens in a web browser.
ru: Верхняя строка окна содержит (слева направо): поле со списком для выбора системы перевода, поле со списком для выбора исходного языка и поле со списком для выбора целевого языка. Под ней располагается область для переводимого текста. Нижняя часть окна содержит область для показа результата перевода. Кнопка <guilabel>Перевести</guilabel> в середине окна отправляет запрос на перевод. В нижней строке окна находится ссылка на систему онлайн-перевода. Она открывается в веб-браузере.

source: To translate something, first select a translation engine. You have the following choice: Google, Yahoo, Excite Japan. Select source and target languages. Available source and target languages depend on selected engine. Available target languages depend on source language as well. Type the text to translate into the source text area. Click the <guilabel>Translate</guilabel> button to start translation. You'll see results in the result text area. Sometimes it may show you <guilabel>Not found!</guilabel> text. It means that translation failed. There can be a number of reasons: source text is too long, the online service is down, the service has changed output format and <application>StarDict</application> is unable to parse it. You may see other errors in the results area.
ru: Чтобы выполнить перевод, необходимо сначала выбрать систему перевода. Доступны следующие варианты: Google, Yahoo, Excite Japan. Выберите исходный и целевой языки. Перечень доступных исходных и целевых языков зависит от выбранной системы перевода. Доступные целевые языки также зависят от исходного языка. Введите в области исходного текста тот текст, который требуется перевести. Нажмите кнопку <guilabel>Перевести</guilabel> для начала перевода. Результат перевода будет показан в соответствующей области. Иногда там может быть показан текст <guilabel>Не найдено!</guilabel>, означающий, что перевод выполнить не удалось. Это может произойти по ряду причин: превышение допустимой длины исходного текста, неработоспособность онлайн-сервиса, смена формата вывода сервисом (из-за чего <application>StarDict</application> не удалось выполнить синтаксический разбор). В области результата могут быть показаны и другие ошибки.

source: Usage
ru: Использование

source: Looking Up a Word
ru: Поиск слова

source: To look up the definition of a word, perform the following steps:
ru: Для поиска перевода слова следует выполнить следующие шаги:

source: Type the word that you want to look up in the Search field.
ru: Введите слово, которое требуется найти, в поле поиска.

source: <application>StarDict</application> will show the definition immediately. If not found, you can press <keycap>Return</keycap> to do a fuzzy query or just click the <guibutton>Fuzzy query</guibutton> button.
ru: <application>StarDict</application> немедленно отобразит перевод. Если перевод не найден, можно нажать клавишу <keycap>Return</keycap> для выполнения нечёткого запроса или просто нажать кнопку <guibutton>Нечёткий запрос</guibutton>.

source: Use the scrollbar to scroll through the definition. Select the words in the Word list to view the related words.
ru: Воспользуйтесь полосой прокрутки для перемещения по переводу. Можно выбирать слова в списке слов.

source: Clearing the Display Area
ru: Очистка области отображения

source: To clear the text of the Search field, click the <guibutton>Clear</guibutton> button on the left, or just press <keycap>Alt-C</keycap> or <keycap>ESC</keycap>.
ru: Чтобы очистить поле поиска, нажмите кнопку <guibutton>Очистить</guibutton>, расположенную слева, или просто нажмите <keycap>Alt-C</keycap> или <keycap>ESC</keycap>.

source: To Copy Text to Another Application
ru: Копирование текста в буфер обмена

source: There are two ways to copy the text in the Definition area to another application:
ru: Есть два способа скопировать текст в области определений в другое приложение:

source: To copy all of the text, click the <guibutton>Copy</guibutton> button by the top of the <guilabel>Definition area</guilabel>.
ru: Чтобы скопировать весь текст, нажмите кнопку <guibutton>Копировать</guibutton>, расположенную над <guilabel>Областью определений</guilabel>.

source: To copy some of the text, select the text that you want to copy, then click your mouse's right button and choose <guimenuitem>Copy</guimenuitem>.
ru: Чтобы скопировать часть текста, выделите её, нажмите правую кнопку мыши и выберите в контекстном меню пункт <guimenuitem>Копировать</guimenuitem>.

source: To Find Text in the Definition Area
ru: Поиск текста в области определений

source: To find text in the Definition area, perform the following steps:
ru: Для поиска текста в области определений следует выполнить следующие шаги:

source: click the <guibutton>Find</guibutton> button by the top of the <guilabel>Definition area</guilabel>.
ru: Нажмите кнопку <guibutton>Найти</guibutton>, расположенную над <guilabel>Областью определений</guilabel>.

source: Type the string that you want to find in the <guilabel>Find</guilabel> text box, then press <keycap>Return</keycap>. You cannot use wildcards.
ru: Введите текст, который следует найти, в текстовом поле <guilabel>Найти</guilabel> и нажмите клавишу <keycap>Return</keycap>. Использовать подстановочные знаки нельзя.

source: To find the next occurrence of the word, press <keycap>Return</keycap> again.
ru: Для поиска следующего совпадения нажмите клавишу <keycap>Return</keycap> снова.

source: Scanning: operation guide
ru: Сканирование: руководство по эксплуатации

source: Scenarios below assume that you make selection with mouse.
ru: В приведённых далее сценариях предполагается, что выделение выполняется с помощью мыши.

source: Scan key is the modifier set by the "Scan modifier key" option, see <xref linkend="stardict-prefs-dictionary-scan"/>.
ru: Клавиша сканирования — это клавиша-модификатор, заданная с помощью параметра «Клавиша-модификатор сканирования», см. <xref linkend="stardict-prefs-dictionary-scan"/>.

source: Scanning in Linux and Unix
ru: Сканирование в Linux и Unix

source: Case 1. "Only scan while modifier key is being pressed" option is off
ru: Случай 1. Параметр «Сканировать, только если нажата клавиша-модификатор» отключён

source: Select text to translate.
ru: Выделите текст для перевода.

source: Wait for a few seconds. The Floating Window pops up.
ru: Подождите несколько секунд. Появится всплывающее окно.

source: Case 2. "Only scan while modifier key is being pressed" option is on
ru: Случай 2. Параметр «Сканировать, только если нажата клавиша-модификатор» включён

source: Press and hold the Scan key.
ru: Нажмите и удерживайте клавишу сканирования.

source: Select the text.
ru: Выделите текст.

source: Release the Scan key.
ru: Отпустите клавишу сканирования.

source: Case 2.1. "Only scan while modifier key is being pressed" option is on. A variation
ru: Случай 2.1. Параметр «Сканировать, только если нажата клавиша-модификатор» включён. Вариант

source: Select the text and do not release the mouse button yet.
ru: Выделите текст и не отпускайте кнопку мыши.

source: Release the mouse button.
ru: Отпустите кнопку мыши.
