Repository: huzheng001/stardict-3.0.6.2
Catalog: dict/help/*/*.po
Languages: ru

source: WordPick Adobe Acrobat plugin is disabled in portable version. Portable application policies forbids to modify the host machine.
ru: Модуль WordPick Adobe Acrobat отключён в переносимой версии. Политики переносимых приложений запрещают изменять хост-компьютер.

source: Run <application>StarDict</application> when Windows starts
ru: Запускать <application>StarDict</application> при запуске Windows

source: This option is disabled in portable version. It does not make sense to autostart application residing on removable storage.
ru: Этот параметр отключён в переносимой версии. Нет смысла автоматически запускать приложение, находящееся на съёмном носителе.

source: Installing StarDict Portable
ru: Установка StarDict Portable

source: This section describes <application>StarDict Portable</application> installation procedure.
ru: В этом разделе описывается процедура установки <application>StarDict Portable</application>.

source: Download and install <ulink url="http://portableapps.com" type="http">PortableApps.com Suite</ulink> on a USB flash drive or wherever you want.
ru: Загрузите и установите <ulink url="http://portableapps.com" type="http">PortableApps.com Suite</ulink> на USB-устройство флэш-памяти или в любое другое нужное расположение.

source: Download <application>StarDict Portable</application> package from <ulink url="https://sourceforge.net/projects/stardict/files/" type="http">StarDict website</ulink>. The package file ends with <filename>.paf.exe</filename>, for example, <filename>StarDictPortable-stardict.sourceforge.com_3.0.2.paf.exe</filename>.
ru: Загрузите пакет <application>StarDict Portable</application> с <ulink url="https://sourceforge.net/projects/stardict/files/" type="http">веб-сайта StarDict</ulink>. Название файла пакета заканчивается на <filename>.paf.exe</filename>, например: <filename>StarDictPortable-stardict.sourceforge.com_3.0.2.paf.exe</filename>.

source: Launch PortableApps.com menu.
ru: Запустите меню PortableApps.com.

source: Click <menuchoice><guibutton>Options</guibutton><guimenu>Install a New Apps</guimenu></menuchoice>. Select <application>StarDict Portable</application> package you've just downloaded, click <guibutton>OK</guibutton> and proceed with installer.
ru: Нажмите <menuchoice><guibutton>Настройки</guibutton><guimenu>Установка новых приложений</guimenu></menuchoice>. Выберите только что загруженный пакет <application>StarDict Portable</application>, нажмите кнопку <guibutton>OK</guibutton> и продолжите работу в установщике.

source: When installation completes, you will have two new items in the menu: <application>StarDict Portable</application> and <application>StarDict Editor portable</application>. You are ready to use <application>StarDict Portable</application>.
ru: После завершения установки в меню появятся два новых пункта: <application>StarDict Portable</application> и <application>StarDict Editor Portable</application>. Теперь можно приступить к работе со <application>StarDict Portable</application>.

source: Launching StarDict Portable directly
ru: Запуск StarDict Portable напрямую

source: You may use <application>StarDict Portable</application> without PortableApps.com menu. In the <filename class="directory">$PortableAppsRoot\PortableApps\StarDictPortable-stardict.sourceforge.com</filename> directory you may find two executables: <filename>StarDictPortable.exe</filename> and <filename>StarDictEditorPortable.exe</filename>, they start <application>StarDict Portable</application> and <application>StarDict Editor Portable</application> respectively. <varname>$PortableAppsRoot</varname> here is the directory where PortableApps.com suite was installed, normally this is the root of a drive, like <filename>X:\</filename>.
ru: <application>StarDict Portable</application> можно использовать и без меню PortableApps.com. В каталоге <filename class="directory">$PortableAppsRoot\PortableApps\StarDictPortable-stardict.sourceforge.com</filename> находятся два исполняемых файла: <filename>StarDictPortable.exe</filename> и <filename>StarDictEditorPortable.exe</filename>. Они запускают, соответственно, <application>StarDict Portable</application> и <application>StarDict Editor Portable</application>. <varname>$PortableAppsRoot</varname> — каталог установки набора PortableApps.com, обычно это корень диска, например <filename>X:\</filename>.

source: You may pass parameters to <application>StarDict Portable</application> as with normal <application>StarDict</application>, see <xref linkend="stardict-details-command-line"/>. This maybe useful to enable logging, for example.
ru: Программе <application>StarDict Portable</application> можно передавать параметры таким же образом, как и обычной программе <application>StarDict</application>, см. <xref linkend="stardict-details-command-line"/>. Например, может быть полезным включение журналирования.

source: Do not start files in the <filename class="directory">$PortableAppsRoot\PortableApps\StarDictPortable-stardict.sourceforge.com\App\StarDict</filename> directory directly! In this case <application>StarDict</application> runs in normal non-portable mode, it will search applications settings and other data file in usually places on the host machine instead of directories near the portable application. First, your settings will not be found, second, new settings will be saved on the host machine.
ru: Не запускайте файлы прямо в каталоге <filename class="directory">$PortableAppsRoot\PortableApps\StarDictPortable-stardict.sourceforge.com\App\StarDict</filename>! В этом случае <application>StarDict</application> будет работать в обычном (а не в мобильном) режиме; поиск файлов настройки и других данных будет выполняться в их обычных расположениях на хост-компьютере, а не в каталогах рядом с переносимым приложением. Во-первых, параметры настройки не будет найдены, а во-вторых, на хост-компьютере будут сохранены новые параметры.

source: This section describes the algorithm used to select interface language in <application>StarDict Portable</application>.
ru: В этом разделе описывается алгоритм, используемый для выбора языка интерфейса в <application>StarDict Portable</application>.

source: Inspect PortableApps.com suite interface language (<menuchoice><guibutton>Options</guibutton><guimenu>Language</guimenu></menuchoice>). If the language is not selected, goto <xref linkend="GUILangSettingsFile"/>. If the language is "en_US", goto <xref linkend="GUILangLanguageVariable"/>. Check if <application>StarDict</application> provides translation to the specified language. Goto <xref linkend="GUILangLanguageVariable"/> if yes, and goto <xref linkend="GUILangSettingsFile"/> otherwise.
ru: Изучить значение параметра интерфейса языка набора PortableApps.com (<menuchoice><guibutton>Настройки</guibutton><guimenu>Язык</guimenu></menuchoice>). Если язык не выбран, перейти к <xref linkend="GUILangSettingsFile"/>. Если язык установлен в значение «en_US», перейти к <xref linkend="GUILangLanguageVariable"/>. Проверить, предоставляет ли <application>StarDict</application> перевод на указанный язык. Если да, перейти к <xref linkend="GUILangLanguageVariable"/>, в ином случае — к <xref linkend="GUILangSettingsFile"/>.

source: Read the <filename class="directory">$PortableAppsRoot\PortableApps\StarDictPortable-stardict.sourceforge.com\Data\settings\StarDictPortableSettigns.ini</filename> file. Inspect value of the <varname>STARDICTLANG</varname> option in the <varname>Language</varname> section. If the option is not specified, goto <xref linkend="GUILangLaunchStarDict"/>. If the value is "en_US", goto <xref linkend="GUILangLanguageVariable"/>. Check if <application>StarDict</application> provides translation to the specified language. Goto <xref linkend="GUILangLanguageVariable"/> if yes, and goto <xref linkend="GUILangLaunchStarDict"/> otherwise.
ru: Прочитать файл <filename class="directory">$PortableAppsRoot\PortableApps\StarDictPortable-stardict.sourceforge.com\Data\settings\StarDictPortableSettigns.ini</filename>. Изучить значение параметра <varname>STARDICTLANG</varname> в разделе <varname>Язык</varname>. Если параметр не указан, перейти к <xref linkend="GUILangLaunchStarDict"/>. Если значение представляет собой «en_US», перейти к <xref linkend="GUILangLanguageVariable"/>. Проверить, предоставляет ли <application>StarDict</application> перевод на указанный язык. Если да, перейти к <xref linkend="GUILangLanguageVariable"/>, в ином случае — к <xref linkend="GUILangLaunchStarDict"/>.

source: Assign the language code to the <varname>STARDICTLANG</varname> environment variable.
ru: Назначить код языка переменной среды <varname>STARDICTLANG</varname>.

source: Launch <application>StarDict</application> executable, namely <filename>stardict.exe</filename>. For subsequent steps see <xref linkend="stardict-details-GUI-lang"/>.
ru: Запустить исполняемый файл <application>StarDict</application>, а именно <filename>stardict.exe</filename>. Последующие шаги см. в разделе <xref linkend="stardict-details-GUI-lang"/>.

source: Troubleshooting
ru: Устранение неисправностей

source: If you experience problems with <application>StarDict</application>, examine <application>StarDict</application> output. By default the application prints the most important messages to standard output and standard error. To see messages, start <application>StarDict</application> from the console. You may increase verbosity of the output using the <parameter class="command">--message-level</parameter> command line option, see <xref linkend="stardict-details-command-line"/>.
ru: Если в работе <application>StarDict</application> возникают проблемы, изучите вывод <application>StarDict</application>. По умолчанию приложение выводит наиболее важные сообщения в стандартный поток вывода и стандартный поток ошибок. Для просмотра сообщений запустите <application>StarDict</application> из консоли. Вывод можно сделать более подробным с помощью параметра командной строки <parameter class="command">--message-level</parameter> (см. <xref linkend="stardict-details-command-line"/>).

source: To see standard output and standard error on Windows, start <application>StarDict</application> from windows console and pass non-zero parameter to the <parameter class="command">--message-level</parameter> command line option. Unfortunately, often windows console can not display all unicode characters that are sent to output. If this problem effects you, redirect output to a file or use <application>StarDict</application> logging facility.
ru: Для просмотра стандартного потока вывода и стандартного потока ошибок в Windows запустите <application>StarDict</application> из консоли Windows и передайте ненулевой аргумент параметру командной строки <parameter class="command">--message-level</parameter>. К сожалению, консоль Windows часто не может отобразить все отправляемые на вывод символы Юникода. В этом случае следует перенаправить вывод в файл или воспользоваться возможностью журналирования <application>StarDict</application>.

source: Starting <application>StarDict</application> from windows console
ru: Запуск <application>StarDict</application> из консоли Windows

source: Starting <application>StarDict</application> from windows console with --message-level option specified. Typical <application>StarDict</application> output.
ru: Запуск <application>StarDict</application> из консоли Windows с указанием параметра --message-level. Типичный вывод <application>StarDict</application>.

source: In some cases, <application>StarDict</application> prints nothing to console or console is not available. Then turn on logging function, see <xref linkend="stardict-details-logging"/> for details.
ru: Иногда <application>StarDict</application> ничего не выводит в консоль или консоль недоступна. В таком случае следует включить возможность журналирования (подробнее: <xref linkend="stardict-details-logging"/>).

source: Related Projects
ru: Связанные проекты

source: <application>StarDict</application> would not be possible without many other projects' contributions. Here is a short list of projects that helped <application>StarDict</application>.
ru: <application>StarDict</application> не удалось бы создать без вклада многих другихпроектов. Здесь приведён краткий список проектов, которые помогли <application>StarDict</application>.

source: The original Motif/LessTif-based StarDict 1.31 written in 1999. <application>StarDict</application> 2 got many good ideas from StarDict1.31 such as "Scan selection." Many of <application>StarDict</application> 2's features, like "Fuzzy query," come from StarDict1.31.
ru: Программа StarDict 1.31, основанная на Motif/LessTif, была написана в 1999 году. <application>StarDict</application> 2 позаимствовала много хороших идей и возможностей из StarDict 1.31, например «Сканирование выделенного» и «Нечёткий запрос».

source: StarDict1.33+ is a big enhancement of StarDict1.31. It added many dictionaries, and so it made me realize that dictionary data was not a barrier to a new, GTK2-based dictionary program. If there had been no StarDict1.33+, I would not have started the <application>StarDict</application> 2 project. The author also helped me to port the StarDict 1.3 dictionary data files to <application>StarDict</application> 2.
ru: StarDict 1.33+ представляет собой значительно улучшенную программу StarDict 1.31. Было добавлено много словарей, и это помогло мне понять, что данные словарей не помешают создать новую словарную оболочку на основе GTK2. Если бы не было StarDict1.33+, я бы не начал проект <application>StarDict</application> 2. Автор также помогал мне портировать файлы данных словарей StarDict 1.3 в <application>StarDict</application> 2.

source: The DICT Project
ru: Проект DICT

source: Many dictd dictionaries have been ported to <application>StarDict</application>. dictzip, which came from dictd, is also used by <application>StarDict</application>.
ru: Многие словари dictd были портированы в <application>StarDict</application>. dictzip, разработанный для dictd, также используется <application>StarDict</application>.

source: To find more information about the DICT Project, please visit <ulink url="http://www.dict.org" type="http">www.dict.org</ulink>.
ru: Для получения дополнительной информации о проекте DICT посетите <ulink url="http://www.dict.org" type="http">www.dict.org</ulink>.

source: Many wquick dictionaries have been ported to <application>StarDict</application>.
ru: &gt;Многие словари wquick словарей были портированы в <application>StarDict</application>.

source: To find more information about *Quick, please visit <ulink url="http://www.futureware.at/quick.htm" type="http">*Quick</ulink>.
ru: Для получения дополнительной информации о проекте *Quick посетите <ulink url="http://www.futureware.at/quick.htm" type="http">*Quick</ulink>.

source: The Blowfish Project
ru: Проект Blowfish

source: The Blowfish Project provided the Oxford English-Chinese dictionary.
ru: Проект Blowfish предоставил Оксфордский английско-китайский словарь.

source: To find more information about the Blowfish Project, please visit the <ulink url="http://igloo.its.unimelb.edu.au/Blowfish/" type="http">Blowfish Project Web site</ulink>.
ru: Для получения дополнительной информации о проекте Blowfish посетите <ulink url="http://igloo.its.unimelb.edu.au/Blowfish/" type="http">сайт проекта Blowfish</ulink>.

source: XDICT's dictionary has been ported to <application>StarDict</application>.
ru: Словари XDICT были портированы в <application>StarDict</application>.

source: cdict5's dictionary has been ported to <application>StarDict</application>.
ru: Словари cdict5 были портированы в <application>StarDict</application>.

source: xcdict-tcltk Web site
ru: Сайт проекта xcdict-tcltk

source: To find more information about the cdict5 Project, please visit the <ulink url="http://www.freshports.org/chinese/cdict5/" type="http">cdict5 on freshports</ulink>.
ru: Для получения дополнительной информации о проекте cdict5 посетите <ulink url="http://www.freshports.org/chinese/cdict5/" type="http">сайт проекта cdict5</ulink>.

source: CEDICT's dictionary has been ported to <application>StarDict</application>.
ru: Словари CEDICT были портированы в <application>StarDict</application>.

source: To find more information about the CEDICT Project, please visit the <ulink url="http://www.mandarintools.com/cedict.html" type="http">CEDICT Project Web site</ulink>.
ru: Для получения дополнительной информации о проекте CEDICT посетите <ulink url="http://www.mandarintools.com/cedict.html" type="http">сайт проекта CEDICT</ulink>.

source: <application>StarDict</application>'s icon was created with this software. CFFD also provided some useful information to me.
ru: Значок <application>StarDict</application> создан с помощью этой программы. CFFD также предоставила полезную информацию для меня.

source: To find more information about the CFFD Project, please visit the <ulink url="http://cffd.cosoft.org.cn" type="http">CFFD Project Web site</ulink>.
ru: Для получения дополнительной информации о проекте CFFD посетите <ulink url="http://cffd.cosoft.org.cn" type="http">сайт проекта CFFD</ulink>.

source: Developers
ru: Разработчики

source: To find more information about <application>StarDict</application>, please visit the <ulink url="http://stardict.sourceforge.net/" type="http">StarDict Web site</ulink>.
ru: Для получения дополнительной информации о <application>StarDict</application> посетите <ulink url="http://stardict.sourceforge.net/" type="http">сайт StarDict</ulink>.

source: Send all comments, suggestions, and bug reports to Hu Zheng (<email>huzheng001@gmail.com</email>).
ru: Присылайте все комментарии, предложения и сообщения об ошибках Hu Zheng (<email>huzheng001@gmail.com</email>).

source: На русский язык переведено Александром Мурыгиным (<email>murygin@aitoc.com</email>). Пожалуйста присылайте все комментарии и предложения относящиеся к этому переводу на этот адрес.
ru: На русский язык переведено Александром Мурыгиным (<email>murygin@aitoc.com</email>). Обновление перевода в 2023 году выполнила Олеся Герасименко (<email>translation-team@basealt.ru</email>). Пожалуйста, присылайте все комментарии и предложения, относящиеся к этому переводу, на эти адреса.
