Repository: huzheng001/stardict-3.0.6.2
Catalog: dict/help/*/*.po
Languages: ru

source: Video
ru: Видео

source: Command for playing video files:
ru: Команда для воспроизведения видеофайлов

source: Specifies a command for playing video files. You may specify a program name (with or without full path) accompaned with any options required. The file name to play will be appended to this command at run time. Video files may be linked with dictionary articles.
ru: Указывает команду для воспроизведения видеофайлов. Можно указать имя программы (с полным путём или без него) и любые необходимые параметры. Имя файла для воспроизведения можно добавить к команде во время выполнения. Видеофайлы могут быть связаны со словарными статьями.

source: Article rendering
ru: Отображение словарной статьи

source: Highlight search term
ru: Выделять поисковый запрос

source: Whether to highlight the search term in the Definition area. A search term is a word that was found in dictionaries, a head word of an article.
ru: Следует ли выделять поисковый запрос в области определений. Поисковый запрос — это слово, которое было найдено в словарях, заглавное слово статьи.

source: Network
ru: Сеть

source: Net Dict
ru: Сетевые словари

source: <application>StarDict</application> may look up words in network dictionaries using a custom <application>StarDict</application> network protocol. This configuration page allows you to register an account, select a server to use, and specify other related parameters.
ru: <application>StarDict</application> может искать слова в сетевых словарях с помощью настраиваемого сетевого протокола <application>StarDict</application>. На этой странице настройки можно зарегистрировать учётную запись, выбрать сервер для использования и указать другие связанные параметры.

source: Enable network dictionaries
ru: Включить сетевые словари

source: Enables to use network dictionaries. You need to specify the dictionaries to use in the Manage Dictionaries dialog if you enable this option.
ru: Включает использование сетевых словарей. Если этот параметр включён, необходимо указать словари для использования в диалоге «Управление словарями».

source: Web browser
ru: Веб-браузер

source: <application>StarDict</application> may need to open a web link to start Internet search, show <application>StarDict</application> project website, show a web page to download new dictionaries, new version of the application and for other reasons. This configuration page allows to specify how a web link should be opened.
ru: <application>StarDict</application> может потребоваться открыть веб-ссылку, чтобы начать поиск в Интернете, показать веб-сайт проекта <application>StarDict</application>, показать веб-страницу для загрузки новых словарей или новой версии приложения и так далее. На этой странице настройки можно указать способ открытия веб-ссылки.

source: Command for opening URLs
ru: Команда для открытия URL-адресов

source: This option allows you to specify a command to use for opening <acronym>URL</acronym>s. Some editions of <application>StarDict</application> use platform-specific services for opening <acronym>URL</acronym>s by default. To use the custom command you need to check the checkbox below. For other editions of <application>StarDict</application> the custom command is the only way to open a web link.
ru: С помощью этого параметра можно указать команду для открытия <acronym>URL-адресов</acronym>. Некоторые версии <application>StarDict</application> по умолчанию задействуют заданные платформами службы для открытия <acronym>URL-адресов</acronym>. Чтобы использовать пользовательскую команду, необходимо установить расположенный ниже флажок. В других версиях <application>StarDict</application> открыть веб-ссылку можно только с помощью пользовательской команды.

source: You may specify a program name (with or without full path) accompaned with any options required. The <acronym>URL</acronym> to open will be appended to this command at run time.
ru: Можно указать имя программы (с полным путём или без него) и любые необходимые параметры. <acronym>URL-адрес</acronym> для открытия будет добавлен к этой команде во время выполнения.

source: Default: <command>firefox</command> (depends on edition).
ru: По умолчанию: <command>firefox</command> (зависит от версии).

source: Always use this command for opening URLs.
ru: Всегда использовать эту команду для открытия URL-адресов

source: This option is only available in editions of <application>StarDict</application> that can use other ways to open a web link.
ru: Этот параметр доступен только в тех версиях <application>StarDict</application>, которые поддерживают другие способы открытия веб-ссылки.

source: Check this option to use the custom command to open web links instead of platform-specific services.
ru: Установите этот флажок, чтобы использовать для открытия веб-ссылок пользовательскую команду, а не заданные платформами службы.

source: Main Window
ru: Главное окно

source: Input
ru: Ввод

source: Search while typing
ru: Искать во время набора

source: When this option is checked, <application>StarDict</application> search for the word you are typing in the search field automatically. <application>StarDict</application> monitors key-press events, it starts searching the word entered as soon as there is no activity for more than a specified amount of time. The time span can be changed in the field below.
ru: Если этот флажок установлен, <application>StarDict</application> автоматически ищет набираемое в поле поиска слово. <application>StarDict</application> отслеживает события нажатия клавиш; программа начинает поиск введённого слова при отсутствии активности в течение указанного периода времени. Время ожидания можно изменить в расположенном ниже поле.

source: When this option is not checked, you need to press <keycombo><keycap>Enter</keycap></keycombo> in order for <application>StarDict</application> to start searching the word.
ru: Если этот флажок не установлен, потребуется нажать клавишу <keycombo><keycap>Ввод</keycap></keycombo>, чтобы программа <application>StarDict</application> начала поиск слова.

source: Word change timeout
ru: Время ожидания после изменения слова

source: A word change timeout in milliseconds. See the option above for details.
ru: Время ожидания после изменения слова в миллисекундах. Подробные сведения доступны в приведённом выше описании параметра.

source: Default: 300 ms
ru: По умолчанию: 320 мс

source: Show the first word when not found.
ru: Показывать первое слово, когда ничего не найдено

source: When <application>StarDict</application> is unable to find the exact word requested, the application may propose another word that is close to the original. When this option is checked, the closest word will be shown in the Definition area, otherwise, <application>StarDict</application> tells that the original word is not found. Note, that this option applies to simple queries only, that is the queries that do not use regular expressions, patterns, fuzzy matchs and so on.
ru: Когда <application>StarDict</application> не удаётся найти точное соответствие запрошенному слову, приложение может предложить другое слово, близкое к исходному. Если этот флажок установлен, самое близкое слово будет показано в области определений. В ином случае <application>StarDict</application> сообщит о том, что исходное слово не найдено. Обратите внимание, этот параметр применяется только к простым запросам (тем, где не используются регулярные выражения, шаблоны, нечёткие совпадения и т.д.).

source: Options
ru: Параметры

source: Skin
ru: Стиль

source: Allows to customize graphical appearance of the application. Select the <emphasis>Default</emphasis> item to restore the original appearance of <application>StarDict</application>, no skins applied. You need to restart the application in order for changes to take effect. For instructions on how to prepare a custom skin see the <filename>doc/Skins</filename> file in <application>StarDict</application> sources.
ru: Позволяет настроить графический вид приложения. Выберите пункт <emphasis>По умолчанию</emphasis> для восстановления исходного внешнего вида <application>StarDict</application> (без применения стиля). Чтобы изменения вступили в силу, необходимо перезапустить приложение. Инструкции по подготовке пользовательского стиля доступны в исходных файлах <application>StarDict</application> (файл <filename>doc/Skins</filename>).

source: Default: <emphasis>Default</emphasis>.
ru: По умолчанию: <emphasis>По умолчанию</emphasis>.

source: Hide main window when starting StarDict.
ru: Скрывать главное окно при запуске StarDict

source: Controls whether the Main window appears when you first start the program. If you select this option, you will only see the Notification area icon after starting <application>StarDict</application>. You may still get to the Main window by clicking on this icon.
ru: Управляет тем, появляется ли главное окно при запуске программы. Если этот флажок установлен, после запуска <application>StarDict</application> будет показан только значок в области уведомлений. Главное окно можно открыть, щёлкнув по нему.

source: Use open main window hotkey
ru: Использовать комбинацию клавиш для открытия главного окна

source: This option enable the hotkey that opens the Main window, and allows to change that hotkey. When enabled, when user presses the hotkey, the Main window is presented to the user.
ru: Этот параметр позволяет включить комбинацию клавиш, которая открывает главное окно, а также изменить её. Если флажок установлен, при нажатии этой комбинации клавиш пользователю будет показано главное окно.

source: Default hotkey: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>z</keycap></keycombo>
ru: Комбинация клавиш по умолчанию: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>z</keycap></keycombo>

source: Transparency
ru: Прозрачность

source: Allows to make the Main window transparent. Moving the slider you may change transparency degree. Transparency is measured in percents, it can range from 0 to 80, where 0 ‒ fully opaque, 80 ‒ almost fully transparent. Moving the slider has an immediate effect on the window.
ru: Позволяет сделать главное окно прозрачным. Перемещайте ползунок для изменения степени прозрачности (эффект виден сразу же). Прозрачность измеряется в процентах, от 0 до 80, где 0 — полная непрозрачность, 80 — почти полная прозрачность.

source: On X11 this has any effect only on X screens with a compositing manager running. On Windows it should work always.
ru: На X11 этот параметр работает только для экранов X с запущенным композитным диспетчером окон. В Windows он работает всегда.

source: Default: 0 ‒ fully opaque.
ru: По умолчанию: 0 — полная непрозрачность.

source: Search website
ru: Поиск в Интернете

source: <application>StarDict</application> may use Web search engines, Web dictionaries, databases providing web-based interface and other web sites providing information by request. The text to search is incorporated into <acronym>URL</acronym>. Normally, the text is assigned to a GET request parameter. For example, to search for word <emphasis>stardict</emphasis> in <ulink url="http://www.google.com" type="http">Google search engine</ulink> you may use the following <acronym>URL</acronym><uri>http://www.google.com/search?q=<replaceable>stardict</replaceable></uri>. You can search websites in <application>StarDict</application> right-clicking the <guibutton>Internet search</guibutton> button in the Main window.
ru: <application>StarDict</application> может использовать поисковые веб-системы, веб-словари, базы данных с веб-интерфейсом и другие веб-сайты, предоставляющие информацию по запросу. Текст для поиска включается в <acronym>URL-адрес</acronym>. Обычно текст назначается параметру запроса GET. Например, для поиска слова <emphasis>stardict</emphasis> в <ulink url="http://www.google.com" type="http">поисковой системе Google</ulink> можно использовать следующий <acronym>URL-адрес</acronym><uri>http://www.google.com/search?q=<replaceable>stardict</replaceable></uri>. В <application>StarDict</application> можно выполнять поиск на веб-сайтах, щёлкнув правой кнопкой мыши по кнопке <guibutton>Поиск в Интернете</guibutton> в главном окне.

source: <application>StarDict</application> does not handle the web request itself, it only composes a <acronym>URL</acronym> and invokes an external program like a web browser or use platform-specific services to open the <acronym>URL</acronym>.
ru: Приложение <application>StarDict</application> не обрабатывает веб-запрос само, а только составляет <acronym>URL-адрес</acronym> и вызывает внешнюю программу (например, веб-браузер) или использует заданные платформой службы для открытия этого <acronym>URL-адреса</acronym>.

source: On this page you may see a list of websites. Use <guilabel>Add</guilabel> and <guilabel>Remove</guilabel> buttons to add new sites and remove existing records. Use <guilabel>Up</guilabel> and <guilabel>Down</guilabel> arrow buttons to reorder records in the list. Each record consists of three items:
ru: На этой странице представлен список веб-сайтов. Кнопки <guilabel>Добавить</guilabel> и <guilabel>Удалить</guilabel> позволяют добавлять новые сайты и удалять существующие записи. С помощью кнопок со стрелками <guilabel>Вверх</guilabel> и <guilabel>Вниз</guilabel> можно изменить порядок записей в списке. Каждая запись состоит из трёх элементов:

source: Website record
ru: Запись веб-сайта

source: Website name
ru: Название сайта

source: This is a label you see in menu. Use a meaningful name.
ru: Это подпись, которая показана в меню. Используйте значимое имя.

source: Website link
ru: Адрес сайта

source: Link to the main page of the website. This link is opened when there is nothing to search for, the Search field is empty.
ru: Ссылка на главную страницу веб-сайта. Эта ссылка открывается, когда нечего искать (поле поиска пусто).

source: Website search link
ru: Поисковая ссылка

source: Link to perform request. <emphasis>%s</emphasis> identifies the place where to insert the search text. For example, <uri>http://www.google.com/search?q=<replaceable>%s</replaceable></uri>.
ru: Ссылка для выполнения запроса. <emphasis>%s</emphasis> указывает, где вставляется текст для поиска. Например: <uri>http://www.google.com/search?q=<replaceable>%s</replaceable></uri>.

source: When middle mouse button is clicked:
ru: Когда нажата средняя кнопка мыши

source: Specifies an action to perform when user clicks the middle mouse button on the Notification area icon. There are the following choices:
ru: Указывает действие, которое следует выполнить, когда пользователь щёлкает средней кнопкой мыши по значку в области уведомлений. Доступны следующие варианты:

source: Query selection in floating window
ru: Искать во всплывающем окне

source: Query selection in main window
ru: Искать в главном окне

source: Do nothing
ru: Ничего не делать

source: In the <guilabel>Do nothing</guilabel> case <application>StarDict</application> simply ignores middle button clicks, otherwise <application>StarDict</application> get text of the current selection, search for it and displays the results either in the Floating window or in the Main window.
ru: Если выбран вариант <guilabel>Ничего не делать</guilabel>, <application>StarDict</application> просто игнорирует щелчки средней кнопкой мыши. В ином случае <application>StarDict</application> получает текст текущего выделения, выполняет его поиск и показывает результат либо во всплывающем окне, либо в главном окне.

source: In case there are a number of windows on desktop having text selected, there might be a confusion what text will be used. <application>StarDict</application> works with the <emphasis>X</emphasis><emphasis>Primary</emphasis> selection. Only one application can own a selection at a time, so when you select something in an application that application becomes the selection owner, the previous owner loses selection ownership. Now back to the question. <application>StarDict</application> will use the text that was selected last.
ru: Если текст выделен в нескольких окнах на рабочем столе, может быть непонятно, какой текст будет использован. <application>StarDict</application> работает с <emphasis>основным</emphasis> выделением <emphasis>X</emphasis>. Выделением одновременно может владеть только одно приложение, поэтому при выборе пользователем какого-либо текста в приложении это приложение становится владельцем выделения; предыдущий владелец утрачивает владение выделением. Вернёмся к рассматриваемому вопросу. <application>StarDict</application> будет использовать тот текст, который был выделен последним.

source: Default: <guilabel>Query selection in floating window</guilabel>.
ru: По умолчанию: <guilabel>Искать во всплывающем окне</guilabel>.

source: Floating Window
ru: Всплывающее окно

source: Pronounce the word when it pops up.
ru: Произнести слово при появлении всплывающего окна

source: When set, pronounce the word when the Floating window shows translation.
ru: Если этот параметр включён, слово будет произноситься при показе перевода во всплывающем окне.

source: Show floating window if word not found.
ru: Показать всплывающее окно, если слово не найдено

source: This option allows to configure what to do if the word to be shown in the Floating window is not found. You have two choices: 1) do not show the Floating window at all ‒ this option is unset, 2) show the Floating window with text indicating that the word was not found ‒ this option is set.
ru: Этот параметр позволяет настроить действие, которое следует выполнять, когда не удалось найти слово для показа во всплывающем окне. Доступны два варианта: 1) вообще не показывать всплывающее окно (для этого нужно снять флажок), 2) показать всплывающее окно с сообщением о том, что слово не было найдено (для этого нужно установить флажок).

source: Settings
ru: Параметры

source: Max window width.
ru: Максимальная ширина окна

source: Sets the Floating window's max width.
ru: Устанавливает максимальную ширину всплывающего окна.

source: Default: 320.
ru: По умолчанию: 320.

source: Max window height.
ru: Максимальная высота окна

source: Sets the Floating window's max height.
ru: Устанавливает максимальную высоту всплывающего окна.

source: Default: 240.
ru: По умолчанию: 240.

source: Use custom background color:
ru: Использовать свой цвет фона

source: Enables to use custom color for background in the Floating window and select that color.
ru: Позволяет использовать настраиваемый цвет фона во всплывающем окне и выбрать этот цвет.

source: Allows to make the Floating window transparent. Moving the slider you may change transparency degree. Transparency is measured in percents, it can range from 0 to 80, where 0 ‒ fully opaque, 80 ‒ almost fully transparent. Moving the slider has an immediate effect on the window.
ru: Позволяет сделать всплывающее окно прозрачным. Перемещайте ползунок для изменения степени прозрачности (эффект виден сразу же). Прозрачность измеряется в процентах, от 0 до 80, где 0 — полная непрозрачность, 80 — почти полная прозрачность.

source: Details
ru: Информация

source: Command line options
ru: Параметры командной строки

source: <application>StarDict</application> usage:
ru: Использование <application>StarDict</application>:

source: options
ru: опции

source: With <replaceable>query_word</replaceable> you request <application>StarDict</application> to look up the specified word just after startup. It has the same effect as if you had typed that word in the Search field. You may use pattens, fuzzy query and other supported modes.
ru: С помощью <replaceable>query_word</replaceable> вы указываете <application>StarDict</application> выполнить поиск указанного слова сразу после запуска. Это работает так же, как ввод этого слова в поле поиска. Можно использовать шаблоны, нечёткий запрос и другие поддерживаемые режимы.

source: -m, --message-level=<replaceable>integer</replaceable>
ru: -m, --message-level=<replaceable>целое число</replaceable>

source: This option specifies the minimum severity level of message that should be printed on console. The value may range from 0 to 6, where 0 means to suppress all output, 6 ‒ print all produced messages, including debug ones. Default value is 4 which passes informational messages, like what dictionaries are loaded during startup.
ru: Эта опция задаёт минимальный уровень серьёзности, при котором сообщение должно быть показано в консоли. Значение может находиться в диапазоне от 0 до 6, где 0 — подавлять весь вывод, 6 — выводить все созданные сообщения, включая отладочные. Значение по умолчанию: 4 (передавать информационные сообщения, например, о том, какие словари загружаются при запуске).

source: -l, --log-level=<replaceable>integer</replaceable>
ru: -l, --log-level=<replaceable>целое число</replaceable>

source: This option specifies the minimum severity level of message that should be logged. The value may range from 0 to 6, where 0 means to suppress all output, 6 ‒ print all produced messages, including debug ones. Default value is 0, that is log file is not used. See <xref linkend="stardict-details-logging"/> for details about <application>StarDict</application> log.
ru: Эта опция задаёт минимальный уровень серьёзности сообщения, при котором его следует сохранить в журнале. Значение может находиться в диапазоне от 0 до 6, где 0 — подавлять весь вывод, 6 — выводить все созданные сообщения, включая отладочные. Значение по умолчанию: 0 (файл журнала не используется). Дополнительные сведения о журнале <application>StarDict</application>: <xref linkend="stardict-details-logging"/>.

source: Do not show splash screen during startup and hide the Main window. Only notification area icon will be visible.
ru: Не показывать заставку при запуске и скрыть главное окно. Будет показан только значок в области уведомлений.

source: Start a new instance of <application>StarDict</application>. By default <application>StarDict</application> checks if the application is already running and prevents starting the second instance.
ru: Запустить новый экземпляр <application>StarDict</application>. По умолчанию программа <application>StarDict</application> проверяет, работает ли уже приложение, и предотвращает запуск второго экземпляра.

source: This option is only available in Windows edition and Gnome edition of <application>StarDict</application>.
ru: Эта опция доступна только в версиях <application>StarDict</application> для Windows и Gnome.

source: Quit an existing instance of <application>StarDict</application>.
ru: Выйти из существующего экземпляра <application>StarDict</application>.

source: This option is only available in Gnome edition of <application>StarDict</application>.
ru: Эта опция доступна только в версии <application>StarDict</application> для Gnome.

source: Specifies path to the <application>StarDict</application> directory configuration file. See <xref linkend="stardict-details-dirs"/> for details about <application>StarDict</application> directories and configuration file.
ru: Указывает путь к файлу настройки каталогов <application>StarDict</application>. Дополнительные сведения о каталогах и файле настройки <application>StarDict</application>: <xref linkend="stardict-details-dirs"/>.

source: This option is only available in Windows edition of <application>StarDict</application>.
ru: Этот параметр доступен только в Windows-версии <application>StarDict</application>.
